; ModuleID = '../src/main.c'
source_filename = "../src/main.c"
target datalayout = "e-m:e-p:32:32-f64:32:64-f80:32-n8:16:32-S128"
target triple = "i386-pc-linux-gnu"

%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { %struct._dnode* }
%union.anon.1 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, void ()*, i32, %struct.k_mem_pool*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout, %struct._wait_q_t }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i8* }
%struct.k_mem_pool = type { %struct.k_heap* }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32 }
%struct.z_thread_stack_element = type { i8 }
%struct._static_thread_data = type { %struct.k_thread*, %struct.z_thread_stack_element*, i32, void (i8*, i8*, i8*)*, i8*, i8*, i8*, i32, i32, i32, void ()*, i8* }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, void (%struct.k_timer*)*, void (%struct.k_timer*)*, %struct.k_timeout_t, i32, i8* }

!11 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "K_OBJ_SEM", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "K_OBJ_STACK", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17, isUnsigned: true)
!27 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18, isUnsigned: true)
!28 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 19, isUnsigned: true)
!29 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 20, isUnsigned: true)
!30 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 21, isUnsigned: true)
!31 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 22, isUnsigned: true)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 23, isUnsigned: true)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 24, isUnsigned: true)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 25, isUnsigned: true)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 26, isUnsigned: true)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 27, isUnsigned: true)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 28, isUnsigned: true)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 29, isUnsigned: true)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 30, isUnsigned: true)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 31, isUnsigned: true)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 32, isUnsigned: true)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 33, isUnsigned: true)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 34, isUnsigned: true)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 35, isUnsigned: true)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 36, isUnsigned: true)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 37, isUnsigned: true)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 38, isUnsigned: true)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 39, isUnsigned: true)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 40, isUnsigned: true)
!50 = !DIEnumerator(name: "K_OBJ_LAST", value: 41, isUnsigned: true)
!51 = !{!52, !57, !58, !59}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "zephyrproject/zephyr/include/sys_clock.h", directory: "/home/kenny")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !55, line: 96, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stdint.h", directory: "")
!56 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !55, line: 172, baseType: !7)
!60 = !{!0, !61, !88, !215, !219, !224, !226, !228}
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "threadB_sem", scope: !2, file: !3, line: 64, type: !63, isLocal: false, isDefinition: true, align: 32)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !6, line: 3721, size: 128, elements: !64)
!64 = !{!65, !86, !87}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !63, file: !6, line: 3722, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !67, line: 210, baseType: !68)
!67 = !DIFile(filename: "zephyrproject/zephyr/include/kernel_structs.h", directory: "/home/kenny")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 208, size: 64, elements: !69)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !68, file: !67, line: 209, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !72, line: 42, baseType: !73)
!72 = !DIFile(filename: "zephyrproject/zephyr/include/sys/dlist.h", directory: "/home/kenny")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !72, line: 31, size: 64, elements: !74)
!74 = !{!75, !81}
!75 = !DIDerivedType(tag: DW_TAG_member, scope: !73, file: !72, line: 32, baseType: !76, size: 32)
!76 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !73, file: !72, line: 32, size: 32, elements: !77)
!77 = !{!78, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !76, file: !72, line: 33, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !76, file: !72, line: 34, baseType: !79, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, scope: !73, file: !72, line: 36, baseType: !82, size: 32, offset: 32)
!82 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !73, file: !72, line: 36, size: 32, elements: !83)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !82, file: !72, line: 37, baseType: !79, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !82, file: !72, line: 38, baseType: !79, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !63, file: !6, line: 3723, baseType: !59, size: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !63, file: !6, line: 3724, baseType: !59, size: 32, offset: 96)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_a", scope: !2, file: !3, line: 103, type: !90, isLocal: false, isDefinition: true, align: 32)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !6, line: 1097, size: 384, elements: !91)
!91 = !{!92, !189, !198, !199, !204, !205, !206, !207, !208, !209, !211, !212}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !90, file: !6, line: 1098, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !6, line: 569, size: 672, elements: !95)
!95 = !{!96, !148, !155, !156, !160, !161, !185}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !94, file: !6, line: 571, baseType: !97, size: 416)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !6, line: 440, size: 416, elements: !98)
!98 = !{!99, !113, !115, !118, !119, !132, !133, !134, !147}
!99 = !DIDerivedType(tag: DW_TAG_member, scope: !97, file: !6, line: 443, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !97, file: !6, line: 443, size: 64, elements: !101)
!101 = !{!102, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !100, file: !6, line: 444, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !72, line: 43, baseType: !73)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !100, file: !6, line: 445, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !106, line: 48, size: 64, elements: !107)
!106 = !DIFile(filename: "zephyrproject/zephyr/include/sys/rb.h", directory: "/home/kenny")
!107 = !{!108}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !105, file: !106, line: 49, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 64, elements: !111)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!111 = !{!112}
!112 = !DISubrange(count: 2)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !97, file: !6, line: 451, baseType: !114, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !97, file: !6, line: 454, baseType: !116, size: 8, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !55, line: 226, baseType: !117)
!117 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !97, file: !6, line: 457, baseType: !116, size: 8, offset: 104)
!119 = !DIDerivedType(tag: DW_TAG_member, scope: !97, file: !6, line: 473, baseType: !120, size: 16, offset: 112)
!120 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !97, file: !6, line: 473, size: 16, elements: !121)
!121 = !{!122, !129}
!122 = !DIDerivedType(tag: DW_TAG_member, scope: !120, file: !6, line: 474, baseType: !123, size: 16)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !120, file: !6, line: 474, size: 16, elements: !124)
!124 = !{!125, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !123, file: !6, line: 479, baseType: !126, size: 8)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !55, line: 224, baseType: !127)
!127 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !123, file: !6, line: 480, baseType: !116, size: 8, offset: 8)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !120, file: !6, line: 483, baseType: !130, size: 16)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !55, line: 207, baseType: !131)
!131 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !97, file: !6, line: 490, baseType: !59, size: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !97, file: !6, line: 510, baseType: !57, size: 32, offset: 160)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !97, file: !6, line: 514, baseType: !135, size: 160, offset: 192)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !67, line: 221, size: 160, elements: !136)
!136 = !{!137, !138, !144}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !135, file: !67, line: 222, baseType: !103, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !135, file: !67, line: 223, baseType: !139, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !67, line: 219, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !135, file: !67, line: 226, baseType: !145, size: 64, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !55, line: 98, baseType: !146)
!146 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "join_waiters", scope: !97, file: !6, line: 517, baseType: !66, size: 64, offset: 352)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !94, file: !6, line: 574, baseType: !149, size: 96, offset: 416)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !150, line: 30, size: 96, elements: !151)
!150 = !DIFile(filename: "zephyrproject/zephyr/include/arch/posix/thread.h", directory: "/home/kenny")
!151 = !{!152, !153, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !149, file: !150, line: 32, baseType: !59, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !149, file: !150, line: 35, baseType: !59, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "thread_status", scope: !149, file: !150, line: 38, baseType: !57, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !94, file: !6, line: 577, baseType: !57, size: 32, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "fn_abort", scope: !94, file: !6, line: 582, baseType: !157, size: 32, offset: 544)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DISubroutineType(types: !159)
!159 = !{null}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !94, file: !6, line: 609, baseType: !58, size: 32, offset: 576)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !94, file: !6, line: 640, baseType: !162, size: 32, offset: 608)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_pool", file: !164, line: 30, size: 32, elements: !165)
!164 = !DIFile(filename: "zephyrproject/zephyr/include/mempool_heap.h", directory: "/home/kenny")
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !163, file: !164, line: 31, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !67, line: 267, size: 160, elements: !169)
!169 = !{!170, !181, !182}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !168, file: !67, line: 268, baseType: !171, size: 96)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !172, line: 51, size: 96, elements: !173)
!172 = !DIFile(filename: "zephyrproject/zephyr/include/sys/sys_heap.h", directory: "/home/kenny")
!173 = !{!174, !177, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !171, file: !172, line: 52, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !172, line: 52, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !171, file: !172, line: 53, baseType: !57, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !171, file: !172, line: 54, baseType: !179, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !180, line: 46, baseType: !7)
!180 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!181 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !168, file: !67, line: 269, baseType: !66, size: 64, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !168, file: !67, line: 270, baseType: !183, offset: 160)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !67, line: 234, elements: !184)
!184 = !{}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !94, file: !6, line: 643, baseType: !186, size: 32, offset: 640)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !150, line: 42, size: 32, elements: !187)
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !186, file: !150, line: 44, baseType: !58, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !90, file: !6, line: 1099, baseType: !190, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !192, line: 44, baseType: !193)
!192 = !DIFile(filename: "zephyrproject/zephyr/include/sys/arch_interface.h", directory: "/home/kenny")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !194, line: 35, size: 8, elements: !195)
!194 = !DIFile(filename: "zephyrproject/zephyr/include/sys/thread_stack.h", directory: "/home/kenny")
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !193, file: !194, line: 36, baseType: !197, size: 8)
!197 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !90, file: !6, line: 1100, baseType: !7, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !90, file: !6, line: 1101, baseType: !200, size: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !192, line: 46, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !57, !57, !57}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !90, file: !6, line: 1102, baseType: !57, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !90, file: !6, line: 1103, baseType: !57, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !90, file: !6, line: 1104, baseType: !57, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !90, file: !6, line: 1105, baseType: !58, size: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !90, file: !6, line: 1106, baseType: !59, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !90, file: !6, line: 1107, baseType: !210, size: 32, offset: 288)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !55, line: 167, baseType: !58)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !90, file: !6, line: 1108, baseType: !157, size: 32, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !90, file: !6, line: 1109, baseType: !213, size: 32, offset: 352)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "thread_a", scope: !2, file: !3, line: 103, type: !217, isLocal: false, isDefinition: true)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !6, line: 647, baseType: !93)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "threadB_stack_area", scope: !2, file: !3, line: 79, type: !221, isLocal: false, isDefinition: true, align: 32)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 8192, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 1024)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "threadB_data", scope: !2, file: !3, line: 80, type: !94, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_a", scope: !2, file: !3, line: 103, type: !221, isLocal: false, isDefinition: true, align: 32)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_a", scope: !2, file: !3, line: 103, type: !94, isLocal: false, isDefinition: true)
!230 = !{i32 1, !"NumRegisterParameters", i32 0}
!231 = !{i32 2, !"Dwarf Version", i32 4}
!232 = !{i32 2, !"Debug Info Version", i32 3}
!233 = !{i32 1, !"wchar_size", i32 4}
!234 = !{!"clang version 9.0.1-12 "}
!235 = distinct !DISubprogram(name: "k_object_access_revoke", scope: !6, file: !6, line: 256, type: !236, scopeLine: 258, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !57, !93}
!238 = !DILocalVariable(name: "object", arg: 1, scope: !235, file: !6, line: 256, type: !57)
!239 = !DILocation(line: 256, column: 49, scope: !235)
!240 = !DILocalVariable(name: "thread", arg: 2, scope: !235, file: !6, line: 257, type: !93)
!241 = !DILocation(line: 257, column: 25, scope: !235)
!242 = !DILocation(line: 259, column: 2, scope: !235)
!243 = !DILocation(line: 260, column: 2, scope: !235)
!244 = !DILocation(line: 261, column: 1, scope: !235)
!245 = distinct !DISubprogram(name: "k_object_access_all_grant", scope: !6, file: !6, line: 271, type: !246, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !57}
!248 = !DILocalVariable(name: "object", arg: 1, scope: !245, file: !6, line: 271, type: !57)
!249 = !DILocation(line: 271, column: 52, scope: !245)
!250 = !DILocation(line: 273, column: 2, scope: !245)
!251 = !DILocation(line: 274, column: 1, scope: !245)
!252 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !6, file: !6, line: 246, type: !236, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!253 = !DILocalVariable(name: "object", arg: 1, scope: !252, file: !6, line: 246, type: !57)
!254 = !DILocation(line: 246, column: 55, scope: !252)
!255 = !DILocalVariable(name: "thread", arg: 2, scope: !252, file: !6, line: 247, type: !93)
!256 = !DILocation(line: 247, column: 30, scope: !252)
!257 = !DILocation(line: 249, column: 2, scope: !252)
!258 = !DILocation(line: 250, column: 2, scope: !252)
!259 = !DILocation(line: 251, column: 1, scope: !252)
!260 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !6, file: !6, line: 266, type: !246, scopeLine: 267, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!261 = !DILocalVariable(name: "object", arg: 1, scope: !260, file: !6, line: 266, type: !57)
!262 = !DILocation(line: 266, column: 50, scope: !260)
!263 = !DILocation(line: 268, column: 2, scope: !260)
!264 = !DILocation(line: 269, column: 1, scope: !260)
!265 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !6, file: !6, line: 382, type: !266, scopeLine: 383, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!266 = !DISubroutineType(types: !267)
!267 = !{!57, !5}
!268 = !DILocalVariable(name: "otype", arg: 1, scope: !265, file: !6, line: 382, type: !5)
!269 = !DILocation(line: 382, column: 58, scope: !265)
!270 = !DILocation(line: 384, column: 2, scope: !265)
!271 = !DILocation(line: 386, column: 2, scope: !265)
!272 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !6, file: !6, line: 1067, type: !273, scopeLine: 1069, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!273 = !DISubroutineType(types: !274)
!274 = !{!52, !93}
!275 = !DILocalVariable(name: "t", arg: 1, scope: !272, file: !6, line: 1068, type: !93)
!276 = !DILocation(line: 1068, column: 24, scope: !272)
!277 = !DILocation(line: 1070, column: 28, scope: !272)
!278 = !DILocation(line: 1070, column: 31, scope: !272)
!279 = !DILocation(line: 1070, column: 36, scope: !272)
!280 = !DILocation(line: 1070, column: 9, scope: !272)
!281 = !DILocation(line: 1070, column: 2, scope: !272)
!282 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !6, file: !6, line: 1082, type: !273, scopeLine: 1084, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!283 = !DILocalVariable(name: "t", arg: 1, scope: !282, file: !6, line: 1083, type: !93)
!284 = !DILocation(line: 1083, column: 24, scope: !282)
!285 = !DILocation(line: 1085, column: 30, scope: !282)
!286 = !DILocation(line: 1085, column: 33, scope: !282)
!287 = !DILocation(line: 1085, column: 38, scope: !282)
!288 = !DILocation(line: 1085, column: 9, scope: !282)
!289 = !DILocation(line: 1085, column: 2, scope: !282)
!290 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !6, file: !6, line: 1966, type: !291, scopeLine: 1967, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!291 = !DISubroutineType(types: !292)
!292 = !{!52, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !6, line: 1766, size: 416, elements: !295)
!295 = !{!296, !297, !298, !302, !303, !308, !309}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !294, file: !6, line: 1772, baseType: !135, size: 160)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !294, file: !6, line: 1775, baseType: !66, size: 64, offset: 160)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !294, file: !6, line: 1778, baseType: !299, size: 32, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 32)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !293}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !294, file: !6, line: 1781, baseType: !299, size: 32, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !294, file: !6, line: 1784, baseType: !304, size: 64, offset: 288)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !53, line: 69, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 67, size: 64, elements: !306)
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !305, file: !53, line: 68, baseType: !52, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !294, file: !6, line: 1787, baseType: !59, size: 32, offset: 352)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !294, file: !6, line: 1790, baseType: !57, size: 32, offset: 384)
!310 = !DILocalVariable(name: "timer", arg: 1, scope: !290, file: !6, line: 1966, type: !293)
!311 = !DILocation(line: 1966, column: 70, scope: !290)
!312 = !DILocation(line: 1968, column: 28, scope: !290)
!313 = !DILocation(line: 1968, column: 35, scope: !290)
!314 = !DILocation(line: 1968, column: 9, scope: !290)
!315 = !DILocation(line: 1968, column: 2, scope: !290)
!316 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !6, file: !6, line: 1980, type: !291, scopeLine: 1981, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!317 = !DILocalVariable(name: "timer", arg: 1, scope: !316, file: !6, line: 1980, type: !293)
!318 = !DILocation(line: 1980, column: 72, scope: !316)
!319 = !DILocation(line: 1982, column: 30, scope: !316)
!320 = !DILocation(line: 1982, column: 37, scope: !316)
!321 = !DILocation(line: 1982, column: 9, scope: !316)
!322 = !DILocation(line: 1982, column: 2, scope: !316)
!323 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !6, file: !6, line: 2021, type: !324, scopeLine: 2023, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !293, !57}
!326 = !DILocalVariable(name: "timer", arg: 1, scope: !323, file: !6, line: 2021, type: !293)
!327 = !DILocation(line: 2021, column: 65, scope: !323)
!328 = !DILocalVariable(name: "user_data", arg: 2, scope: !323, file: !6, line: 2022, type: !57)
!329 = !DILocation(line: 2022, column: 19, scope: !323)
!330 = !DILocation(line: 2024, column: 21, scope: !323)
!331 = !DILocation(line: 2024, column: 2, scope: !323)
!332 = !DILocation(line: 2024, column: 9, scope: !323)
!333 = !DILocation(line: 2024, column: 19, scope: !323)
!334 = !DILocation(line: 2025, column: 1, scope: !323)
!335 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !6, file: !6, line: 2036, type: !336, scopeLine: 2037, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!336 = !DISubroutineType(types: !337)
!337 = !{!57, !293}
!338 = !DILocalVariable(name: "timer", arg: 1, scope: !335, file: !6, line: 2036, type: !293)
!339 = !DILocation(line: 2036, column: 66, scope: !335)
!340 = !DILocation(line: 2038, column: 9, scope: !335)
!341 = !DILocation(line: 2038, column: 16, scope: !335)
!342 = !DILocation(line: 2038, column: 2, scope: !335)
!343 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !6, file: !6, line: 2465, type: !344, scopeLine: 2466, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!344 = !DISubroutineType(types: !345)
!345 = !{!58, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !6, line: 2202, size: 128, elements: !348)
!348 = !{!349, !362, !363}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !347, file: !6, line: 2203, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !351, line: 45, baseType: !352)
!351 = !DIFile(filename: "zephyrproject/zephyr/include/sys/sflist.h", directory: "/home/kenny")
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !351, line: 40, size: 64, elements: !353)
!353 = !{!354, !361}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !352, file: !351, line: 41, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !351, line: 38, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !351, line: 34, size: 32, elements: !358)
!358 = !{!359}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !357, file: !351, line: 35, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !351, line: 31, baseType: !59)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !352, file: !351, line: 42, baseType: !355, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !347, file: !6, line: 2204, baseType: !183, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !347, file: !6, line: 2205, baseType: !66, size: 64, offset: 64)
!364 = !DILocalVariable(name: "queue", arg: 1, scope: !343, file: !6, line: 2465, type: !346)
!365 = !DILocation(line: 2465, column: 59, scope: !343)
!366 = !DILocation(line: 2467, column: 35, scope: !343)
!367 = !DILocation(line: 2467, column: 42, scope: !343)
!368 = !DILocation(line: 2467, column: 14, scope: !343)
!369 = !DILocation(line: 2467, column: 9, scope: !343)
!370 = !DILocation(line: 2467, column: 2, scope: !343)
!371 = distinct !DISubprogram(name: "z_impl_k_queue_peek_head", scope: !6, file: !6, line: 2481, type: !372, scopeLine: 2482, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!372 = !DISubroutineType(types: !373)
!373 = !{!57, !346}
!374 = !DILocalVariable(name: "queue", arg: 1, scope: !371, file: !6, line: 2481, type: !346)
!375 = !DILocation(line: 2481, column: 62, scope: !371)
!376 = !DILocation(line: 2483, column: 49, scope: !371)
!377 = !DILocation(line: 2483, column: 56, scope: !371)
!378 = !DILocation(line: 2483, column: 27, scope: !371)
!379 = !DILocation(line: 2483, column: 9, scope: !371)
!380 = !DILocation(line: 2483, column: 2, scope: !371)
!381 = distinct !DISubprogram(name: "z_impl_k_queue_peek_tail", scope: !6, file: !6, line: 2497, type: !372, scopeLine: 2498, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!382 = !DILocalVariable(name: "queue", arg: 1, scope: !381, file: !6, line: 2497, type: !346)
!383 = !DILocation(line: 2497, column: 62, scope: !381)
!384 = !DILocation(line: 2499, column: 49, scope: !381)
!385 = !DILocation(line: 2499, column: 56, scope: !381)
!386 = !DILocation(line: 2499, column: 27, scope: !381)
!387 = !DILocation(line: 2499, column: 9, scope: !381)
!388 = !DILocation(line: 2499, column: 2, scope: !381)
!389 = distinct !DISubprogram(name: "z_impl_k_sem_reset", scope: !6, file: !6, line: 3813, type: !390, scopeLine: 3814, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !392}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!393 = !DILocalVariable(name: "sem", arg: 1, scope: !389, file: !6, line: 3813, type: !392)
!394 = !DILocation(line: 3813, column: 53, scope: !389)
!395 = !DILocation(line: 3815, column: 2, scope: !389)
!396 = !DILocation(line: 3815, column: 7, scope: !389)
!397 = !DILocation(line: 3815, column: 13, scope: !389)
!398 = !DILocation(line: 3816, column: 1, scope: !389)
!399 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !6, file: !6, line: 3832, type: !400, scopeLine: 3833, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!400 = !DISubroutineType(types: !401)
!401 = !{!7, !392}
!402 = !DILocalVariable(name: "sem", arg: 1, scope: !399, file: !6, line: 3832, type: !392)
!403 = !DILocation(line: 3832, column: 65, scope: !399)
!404 = !DILocation(line: 3834, column: 9, scope: !399)
!405 = !DILocation(line: 3834, column: 14, scope: !399)
!406 = !DILocation(line: 3834, column: 2, scope: !399)
!407 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !6, file: !6, line: 4105, type: !408, scopeLine: 4106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!408 = !DISubroutineType(types: !409)
!409 = !{!59, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !6, line: 3865, size: 320, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !419, !420, !421, !422, !423}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !411, file: !6, line: 3867, baseType: !66, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !411, file: !6, line: 3869, baseType: !183, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !411, file: !6, line: 3871, baseType: !179, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !411, file: !6, line: 3873, baseType: !59, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !411, file: !6, line: 3875, baseType: !418, size: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !411, file: !6, line: 3877, baseType: !418, size: 32, offset: 160)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !411, file: !6, line: 3879, baseType: !418, size: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !411, file: !6, line: 3881, baseType: !418, size: 32, offset: 224)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !411, file: !6, line: 3883, baseType: !59, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !411, file: !6, line: 3889, baseType: !116, size: 8, offset: 288)
!424 = !DILocalVariable(name: "msgq", arg: 1, scope: !407, file: !6, line: 4105, type: !410)
!425 = !DILocation(line: 4105, column: 66, scope: !407)
!426 = !DILocation(line: 4107, column: 9, scope: !407)
!427 = !DILocation(line: 4107, column: 15, scope: !407)
!428 = !DILocation(line: 4107, column: 26, scope: !407)
!429 = !DILocation(line: 4107, column: 32, scope: !407)
!430 = !DILocation(line: 4107, column: 24, scope: !407)
!431 = !DILocation(line: 4107, column: 2, scope: !407)
!432 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !6, file: !6, line: 4121, type: !408, scopeLine: 4122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!433 = !DILocalVariable(name: "msgq", arg: 1, scope: !432, file: !6, line: 4121, type: !410)
!434 = !DILocation(line: 4121, column: 66, scope: !432)
!435 = !DILocation(line: 4123, column: 9, scope: !432)
!436 = !DILocation(line: 4123, column: 15, scope: !432)
!437 = !DILocation(line: 4123, column: 2, scope: !432)
!438 = distinct !DISubprogram(name: "z_impl_k_poll_signal_reset", scope: !6, file: !6, line: 5146, type: !439, scopeLine: 5147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !6, line: 4984, size: 128, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !442, file: !6, line: 4986, baseType: !71, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !442, file: !6, line: 4992, baseType: !7, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !442, file: !6, line: 4995, baseType: !58, size: 32, offset: 96)
!447 = !DILocalVariable(name: "signal", arg: 1, scope: !438, file: !6, line: 5146, type: !441)
!448 = !DILocation(line: 5146, column: 69, scope: !438)
!449 = !DILocation(line: 5148, column: 2, scope: !438)
!450 = !DILocation(line: 5148, column: 10, scope: !438)
!451 = !DILocation(line: 5148, column: 19, scope: !438)
!452 = !DILocation(line: 5149, column: 1, scope: !438)
!453 = distinct !DISubprogram(name: "helloLoop", scope: !3, file: !3, line: 36, type: !454, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !184)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !213, !392, !392}
!456 = !DILocalVariable(name: "my_name", arg: 1, scope: !453, file: !3, line: 36, type: !213)
!457 = !DILocation(line: 36, column: 28, scope: !453)
!458 = !DILocalVariable(name: "my_sem", arg: 2, scope: !453, file: !3, line: 37, type: !392)
!459 = !DILocation(line: 37, column: 23, scope: !453)
!460 = !DILocalVariable(name: "other_sem", arg: 3, scope: !453, file: !3, line: 37, type: !392)
!461 = !DILocation(line: 37, column: 45, scope: !453)
!462 = !DILocalVariable(name: "tname", scope: !453, file: !3, line: 39, type: !213)
!463 = !DILocation(line: 39, column: 14, scope: !453)
!464 = !DILocation(line: 41, column: 2, scope: !453)
!465 = !DILocation(line: 43, column: 14, scope: !466)
!466 = distinct !DILexicalBlock(scope: !453, file: !3, line: 41, column: 12)
!467 = !DILocation(line: 43, column: 22, scope: !466)
!468 = !DILocation(line: 43, column: 3, scope: !466)
!469 = !DILocation(line: 46, column: 29, scope: !466)
!470 = !DILocation(line: 46, column: 11, scope: !466)
!471 = !DILocation(line: 46, column: 9, scope: !466)
!472 = !DILocation(line: 47, column: 7, scope: !473)
!473 = distinct !DILexicalBlock(scope: !466, file: !3, line: 47, column: 7)
!474 = !DILocation(line: 47, column: 13, scope: !473)
!475 = !DILocation(line: 47, column: 7, scope: !466)
!476 = !DILocation(line: 49, column: 5, scope: !477)
!477 = distinct !DILexicalBlock(scope: !473, file: !3, line: 47, column: 22)
!478 = !DILocation(line: 48, column: 4, scope: !477)
!479 = !DILocation(line: 50, column: 3, scope: !477)
!480 = !DILocation(line: 52, column: 5, scope: !481)
!481 = distinct !DILexicalBlock(scope: !473, file: !3, line: 50, column: 10)
!482 = !DILocation(line: 51, column: 4, scope: !481)
!483 = !DILocation(line: 56, column: 3, scope: !466)
!484 = !DILocation(line: 57, column: 14, scope: !466)
!485 = !DILocation(line: 57, column: 3, scope: !466)
!486 = distinct !{!486, !464, !487}
!487 = !DILocation(line: 58, column: 2, scope: !453)
!488 = distinct !DISubprogram(name: "k_sem_take", scope: !489, file: !489, line: 746, type: !490, scopeLine: 747, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
!489 = !DIFile(filename: "zephyr/include/generated/syscalls/kernel.h", directory: "/home/kenny/ara/appl/Zephyr/synchronization/build")
!490 = !DISubroutineType(types: !491)
!491 = !{!58, !392, !304}
!492 = !DILocalVariable(name: "sem", arg: 1, scope: !488, file: !489, line: 746, type: !392)
!493 = !DILocation(line: 746, column: 45, scope: !488)
!494 = !DILocalVariable(name: "timeout", arg: 2, scope: !488, file: !489, line: 746, type: !304)
!495 = !DILocation(line: 746, column: 62, scope: !488)
!496 = !DILocation(line: 755, column: 2, scope: !488)
!497 = !DILocation(line: 755, column: 2, scope: !498)
!498 = distinct !DILexicalBlock(scope: !488, file: !489, line: 755, column: 2)
!499 = !{i32 -2146410751}
!500 = !DILocation(line: 756, column: 27, scope: !488)
!501 = !DILocation(line: 756, column: 9, scope: !488)
!502 = !DILocation(line: 756, column: 2, scope: !488)
!503 = distinct !DISubprogram(name: "k_current_get", scope: !489, file: !489, line: 187, type: !504, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !184)
