; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct.device = type { i8*, i8*, i8*, i8* }
%struct.gpio_driver_api = type { i32 (%struct.device*, i8, i32)*, i32 (%struct.device*, i32*)*, i32 (%struct.device*, i32, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i8, i32, i32)*, i32 (%struct.device*, %struct.gpio_callback*, i1)*, i32 (%struct.device*)* }
%struct.gpio_callback = type { %struct._snode, void (%struct.device*, %struct.gpio_callback*, i32)*, i32 }
%struct._snode = type { %struct._snode* }
%struct.gpio_driver_config = type { i32 }
%struct.k_timeout_t = type { i64 }

@.str = private unnamed_addr constant [6 x i8] c"GPIOA\00", align 1

; Function Attrs: noinline nounwind optnone
define dso_local void @main() #0 !dbg !159 {
  %1 = alloca %struct.device*, align 4
  %2 = alloca i8, align 1
  %3 = alloca i32, align 4
  call void @llvm.dbg.declare(metadata %struct.device** %1, metadata !164, metadata !DIExpression()), !dbg !166
  call void @llvm.dbg.declare(metadata i8* %2, metadata !167, metadata !DIExpression()), !dbg !168
  store i8 1, i8* %2, align 1, !dbg !168
  call void @llvm.dbg.declare(metadata i32* %3, metadata !169, metadata !DIExpression()), !dbg !170

!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!7 = !DIEnumerator(name: "K_OBJ_ANY", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "K_OBJ_SEM", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "K_OBJ_STACK", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11, isUnsigned: true)
!19 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12, isUnsigned: true)
!20 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13, isUnsigned: true)
!21 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14, isUnsigned: true)
!22 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15, isUnsigned: true)
!23 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 16, isUnsigned: true)
!24 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18, isUnsigned: true)
!26 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 19, isUnsigned: true)
!27 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 20, isUnsigned: true)
!28 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 21, isUnsigned: true)
!29 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 22, isUnsigned: true)
!30 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 23, isUnsigned: true)
!31 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 24, isUnsigned: true)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 25, isUnsigned: true)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 26, isUnsigned: true)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 27, isUnsigned: true)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 28, isUnsigned: true)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 29, isUnsigned: true)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 30, isUnsigned: true)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 31, isUnsigned: true)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 32, isUnsigned: true)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 33, isUnsigned: true)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 34, isUnsigned: true)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 35, isUnsigned: true)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 36, isUnsigned: true)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 37, isUnsigned: true)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 38, isUnsigned: true)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 39, isUnsigned: true)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 40, isUnsigned: true)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 41, isUnsigned: true)
!49 = !DIEnumerator(name: "K_OBJ_LAST", value: 42, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !51, line: 395, baseType: !52, size: 32, elements: !53)
!51 = !DIFile(filename: "zephyrproject/zephyr/include/drivers/gpio.h", directory: "/home/kenny")
!52 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!53 = !{!54, !55, !56}
!54 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 8192, isUnsigned: true)
!55 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 16384, isUnsigned: true)
!56 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 81920, isUnsigned: true)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !51, line: 401, baseType: !52, size: 32, elements: !58)
!58 = !{!59, !60, !61}
!59 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 131072, isUnsigned: true)
!60 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 262144, isUnsigned: true)
!61 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 393216, isUnsigned: true)
!62 = !{!63, !64, !65, !139, !144, !103, !57, !50, !149, !150, !92}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!64 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !51, line: 412, size: 288, elements: !68)
!68 = !{!69, !93, !99, !104, !108, !109, !110, !114, !135}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !67, file: !51, line: 413, baseType: !70, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!71 = !DISubroutineType(types: !72)
!72 = !{!64, !73, !88, !91}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !76, line: 200, size: 128, elements: !77)
!76 = !DIFile(filename: "zephyrproject/zephyr/include/device.h", directory: "/home/kenny")
!77 = !{!78, !82, !85, !86}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !75, file: !76, line: 202, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !75, file: !76, line: 204, baseType: !83, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !75, file: !76, line: 206, baseType: !83, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !75, file: !76, line: 208, baseType: !87, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !51, line: 288, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !90, line: 55, baseType: !5)
!90 = !DIFile(filename: "zephyrproject/zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/kenny")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !51, line: 305, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !90, line: 57, baseType: !52)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !67, file: !51, line: 415, baseType: !94, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 32)
!95 = !DISubroutineType(types: !96)
!96 = !{!64, !73, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !51, line: 280, baseType: !92)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !67, file: !51, line: 417, baseType: !100, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DISubroutineType(types: !102)
!102 = !{!64, !73, !103, !98}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !51, line: 267, baseType: !92)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !67, file: !51, line: 420, baseType: !105, size: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DISubroutineType(types: !107)
!107 = !{!64, !73, !103}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !67, file: !51, line: 422, baseType: !105, size: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !67, file: !51, line: 424, baseType: !105, size: 32, offset: 160)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !67, file: !51, line: 426, baseType: !111, size: 32, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!112 = !DISubroutineType(types: !113)
!113 = !{!64, !73, !88, !50, !57}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !67, file: !51, line: 429, baseType: !115, size: 32, offset: 224)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DISubroutineType(types: !117)
!117 = !{!64, !73, !118, !134}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !51, line: 367, size: 96, elements: !120)
!120 = !{!121, !128, !133}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !119, file: !51, line: 371, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !123, line: 33, baseType: !124)
!123 = !DIFile(filename: "zephyrproject/zephyr/include/sys/slist.h", directory: "/home/kenny")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !123, line: 29, size: 32, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !124, file: !123, line: 30, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !119, file: !51, line: 374, baseType: !129, size: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !51, line: 353, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !73, !118, !103}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !119, file: !51, line: 382, baseType: !103, size: 32, offset: 64)
!134 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !67, file: !51, line: 432, baseType: !136, size: 32, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DISubroutineType(types: !138)
!138 = !{!92, !73}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !51, line: 317, size: 32, elements: !142)
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !141, file: !51, line: 323, baseType: !103, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !51, line: 330, size: 32, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !146, file: !51, line: 336, baseType: !103, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !151, line: 46, baseType: !152)
!151 = !DIFile(filename: "zephyrproject/zephyr/include/sys_clock.h", directory: "/home/kenny")
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !90, line: 43, baseType: !153)
!153 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!154 = !{!"clang version 9.0.1-12 "}
!155 = !{i32 2, !"Dwarf Version", i32 4}
!156 = !{i32 2, !"Debug Info Version", i32 3}
!157 = !{i32 1, !"wchar_size", i32 4}
!158 = !{i32 1, !"min_enum_size", i32 1}
!159 = distinct !DISubprogram(name: "main", scope: !160, file: !160, line: 35, type: !161, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !163)
!160 = !DIFile(filename: "appl/Zephyr/blinky/src/main.c", directory: "/home/kenny/ara")
!161 = !DISubroutineType(types: !162)
!162 = !{null}
!163 = !{}
!164 = !DILocalVariable(name: "dev", scope: !159, file: !160, line: 37, type: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!166 = !DILocation(line: 37, column: 17, scope: !159)
!167 = !DILocalVariable(name: "led_is_on", scope: !159, file: !160, line: 38, type: !134)
!168 = !DILocation(line: 38, column: 7, scope: !159)
!169 = !DILocalVariable(name: "ret", scope: !159, file: !160, line: 39, type: !64)
!170 = !DILocation(line: 39, column: 6, scope: !159)
!171 = !DILocation(line: 41, column: 8, scope: !159)
!172 = !DILocation(line: 41, column: 6, scope: !159)
!173 = !DILocation(line: 42, column: 6, scope: !174)
!174 = distinct !DILexicalBlock(scope: !159, file: !160, line: 42, column: 6)
!175 = !DILocation(line: 42, column: 10, scope: !174)
!176 = !DILocation(line: 42, column: 6, scope: !159)
!177 = !DILocation(line: 43, column: 3, scope: !178)
!178 = distinct !DILexicalBlock(scope: !174, file: !160, line: 42, column: 19)
!179 = !DILocation(line: 46, column: 27, scope: !159)
!180 = !DILocation(line: 46, column: 8, scope: !159)
!181 = !DILocation(line: 46, column: 6, scope: !159)
!182 = !DILocation(line: 47, column: 6, scope: !183)
!183 = distinct !DILexicalBlock(scope: !159, file: !160, line: 47, column: 6)
!184 = !DILocation(line: 47, column: 10, scope: !183)
!185 = !DILocation(line: 47, column: 6, scope: !159)
!186 = !DILocation(line: 48, column: 3, scope: !187)
!187 = distinct !DILexicalBlock(scope: !183, file: !160, line: 47, column: 15)
!188 = !DILocation(line: 51, column: 2, scope: !159)
!189 = !DILocation(line: 52, column: 16, scope: !190)
!190 = distinct !DILexicalBlock(scope: !159, file: !160, line: 51, column: 12)
!191 = !DILocation(line: 52, column: 31, scope: !190)
!192 = !DILocation(line: 52, column: 26, scope: !190)
!193 = !DILocation(line: 52, column: 3, scope: !190)
!194 = !DILocation(line: 53, column: 16, scope: !190)
