; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct.gpio_callback = type { %struct._snode, void (%struct.device*, %struct.gpio_callback*, i32)*, i32 }
%struct._snode = type { %struct._snode* }
%struct.device = type { i8*, i8*, i8*, i8* }
%struct.gpio_driver_api = type { i32 (%struct.device*, i8, i32)*, i32 (%struct.device*, i32*)*, i32 (%struct.device*, i32, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i8, i32, i32)*, i32 (%struct.device*, %struct.gpio_callback*, i1)*, i32 (%struct.device*)* }
%struct.gpio_driver_config = type { i32 }
%struct.k_timeout_t = type { i64 }

@.str = private unnamed_addr constant [22 x i8] c"Button pressed at %u\0A\00", align 1
@.str.1 = private unnamed_addr constant [6 x i8] c"GPIOC\00", align 1
@.str.2 = private unnamed_addr constant [30 x i8] c"Error: didn't find %s device\0A\00", align 1
@.str.3 = private unnamed_addr constant [41 x i8] c"Error %d: failed to configure %s pin %d\0A\00", align 1
@.str.4 = private unnamed_addr constant [54 x i8] c"Error %d: failed to configure interrupt on %s pin %d\0A\00", align 1
@button_cb_data = internal global %struct.gpio_callback zeroinitializer, align 4, !dbg !0
@.str.5 = private unnamed_addr constant [28 x i8] c"Set up button at %s pin %d\0A\00", align 1

!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!9 = !DIEnumerator(name: "K_OBJ_ANY", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "K_OBJ_SEM", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "K_OBJ_STACK", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17, isUnsigned: true)
!27 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18, isUnsigned: true)
!28 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 19, isUnsigned: true)
!29 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 20, isUnsigned: true)
!30 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 21, isUnsigned: true)
!31 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 22, isUnsigned: true)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 23, isUnsigned: true)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 24, isUnsigned: true)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 25, isUnsigned: true)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 26, isUnsigned: true)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 27, isUnsigned: true)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 28, isUnsigned: true)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 29, isUnsigned: true)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 30, isUnsigned: true)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 31, isUnsigned: true)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 32, isUnsigned: true)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 33, isUnsigned: true)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 34, isUnsigned: true)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 35, isUnsigned: true)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 36, isUnsigned: true)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 37, isUnsigned: true)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 38, isUnsigned: true)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 39, isUnsigned: true)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 40, isUnsigned: true)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 41, isUnsigned: true)
!51 = !DIEnumerator(name: "K_OBJ_LAST", value: 42, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !53, line: 395, baseType: !54, size: 32, elements: !55)
!53 = !DIFile(filename: "zephyrproject/zephyr/include/drivers/gpio.h", directory: "/home/kenny")
!54 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!55 = !{!56, !57, !58}
!56 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 8192, isUnsigned: true)
!57 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 16384, isUnsigned: true)
!58 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 81920, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !53, line: 401, baseType: !54, size: 32, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 131072, isUnsigned: true)
!62 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 262144, isUnsigned: true)
!63 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 393216, isUnsigned: true)
!64 = !{!65, !66, !67, !141, !146, !105, !59, !52, !151, !152, !94}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !53, line: 412, size: 288, elements: !70)
!70 = !{!71, !95, !101, !106, !110, !111, !112, !116, !137}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !69, file: !53, line: 413, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!73 = !DISubroutineType(types: !74)
!74 = !{!66, !75, !90, !93}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !78, line: 200, size: 128, elements: !79)
!78 = !DIFile(filename: "zephyrproject/zephyr/include/device.h", directory: "/home/kenny")
!79 = !{!80, !84, !87, !88}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !78, line: 202, baseType: !81, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !77, file: !78, line: 204, baseType: !85, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !77, file: !78, line: 206, baseType: !85, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !78, line: 208, baseType: !89, size: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !53, line: 288, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !92, line: 55, baseType: !7)
!92 = !DIFile(filename: "zephyrproject/zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/kenny")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !53, line: 305, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !92, line: 57, baseType: !54)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !69, file: !53, line: 415, baseType: !96, size: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!97 = !DISubroutineType(types: !98)
!98 = !{!66, !75, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !53, line: 280, baseType: !94)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !69, file: !53, line: 417, baseType: !102, size: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DISubroutineType(types: !104)
!104 = !{!66, !75, !105, !100}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !53, line: 267, baseType: !94)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !69, file: !53, line: 420, baseType: !107, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DISubroutineType(types: !109)
!109 = !{!66, !75, !105}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !69, file: !53, line: 422, baseType: !107, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !69, file: !53, line: 424, baseType: !107, size: 32, offset: 160)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !69, file: !53, line: 426, baseType: !113, size: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DISubroutineType(types: !115)
!115 = !{!66, !75, !90, !52, !59}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !69, file: !53, line: 429, baseType: !117, size: 32, offset: 224)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DISubroutineType(types: !119)
!119 = !{!66, !75, !120, !136}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !53, line: 367, size: 96, elements: !122)
!122 = !{!123, !130, !135}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !121, file: !53, line: 371, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !125, line: 33, baseType: !126)
!125 = !DIFile(filename: "zephyrproject/zephyr/include/sys/slist.h", directory: "/home/kenny")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !125, line: 29, size: 32, elements: !127)
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !125, line: 30, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !121, file: !53, line: 374, baseType: !131, size: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !53, line: 353, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !75, !120, !105}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !121, file: !53, line: 382, baseType: !105, size: 32, offset: 64)
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !69, file: !53, line: 432, baseType: !138, size: 32, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DISubroutineType(types: !140)
!140 = !{!94, !75}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !53, line: 317, size: 32, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !143, file: !53, line: 323, baseType: !105, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !53, line: 330, size: 32, elements: !149)
!149 = !{!150}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !148, file: !53, line: 336, baseType: !105, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !153, line: 46, baseType: !154)
!153 = !DIFile(filename: "zephyrproject/zephyr/include/sys_clock.h", directory: "/home/kenny")
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !92, line: 43, baseType: !155)
!155 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!156 = !{!0}
!157 = !DIFile(filename: "appl/Zephyr/button/src/main.c", directory: "/home/kenny/ara")
!158 = !{!"clang version 9.0.1-12 "}
!159 = !{i32 2, !"Dwarf Version", i32 4}
!160 = !{i32 2, !"Debug Info Version", i32 3}
!161 = !{i32 1, !"wchar_size", i32 4}
!162 = !{i32 1, !"min_enum_size", i32 1}
!163 = distinct !DISubprogram(name: "button_pressed", scope: !157, file: !157, line: 43, type: !164, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !167)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !166, !120, !94}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!167 = !{}
!168 = !DILocalVariable(name: "dev", arg: 1, scope: !163, file: !157, line: 43, type: !166)
!169 = !DILocation(line: 43, column: 36, scope: !163)
!170 = !DILocalVariable(name: "cb", arg: 2, scope: !163, file: !157, line: 43, type: !120)
!171 = !DILocation(line: 43, column: 63, scope: !163)
!172 = !DILocalVariable(name: "pins", arg: 3, scope: !163, file: !157, line: 44, type: !94)
!173 = !DILocation(line: 44, column: 16, scope: !163)
!174 = !DILocation(line: 46, column: 44, scope: !163)
!175 = !DILocation(line: 46, column: 2, scope: !163)
!176 = !DILocation(line: 47, column: 1, scope: !163)
!177 = distinct !DISubprogram(name: "k_cycle_get_32", scope: !6, file: !6, line: 2172, type: !178, scopeLine: 2173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !167)
!178 = !DISubroutineType(types: !179)
!179 = !{!94}
!180 = !DILocation(line: 2174, column: 9, scope: !177)
!181 = !DILocation(line: 2174, column: 2, scope: !177)
!182 = distinct !DISubprogram(name: "arch_k_cycle_get_32", scope: !183, file: !183, line: 24, type: !178, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !167)
!183 = !DIFile(filename: "zephyrproject/zephyr/include/arch/arm/aarch32/misc.h", directory: "/home/kenny")
!184 = !DILocation(line: 26, column: 9, scope: !182)
!185 = !DILocation(line: 26, column: 2, scope: !182)
!186 = distinct !DISubprogram(name: "main", scope: !157, file: !157, line: 49, type: !187, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !167)
!187 = !DISubroutineType(types: !188)
!188 = !{null}
!189 = !DILocalVariable(name: "button", scope: !186, file: !157, line: 51, type: !166)
!190 = !DILocation(line: 51, column: 17, scope: !186)
