; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, void ()*, i32, %struct._thread_stack_info, %struct.k_mem_pool*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout, %struct._wait_q_t }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_mem_pool = type { %struct.k_heap* }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.k_stack = type { %struct._wait_q_t, %struct.k_spinlock, i32*, i32*, i32*, i8 }
%struct.z_thread_stack_element = type { i8 }
%struct.k_timeout_t = type { i64 }

@guard = dso_local global %struct.k_mutex zeroinitializer, align 4, !dbg !0

!38 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 29, isUnsigned: true)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 30, isUnsigned: true)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 31, isUnsigned: true)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 32, isUnsigned: true)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 33, isUnsigned: true)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 34, isUnsigned: true)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 35, isUnsigned: true)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 36, isUnsigned: true)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 37, isUnsigned: true)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 38, isUnsigned: true)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 39, isUnsigned: true)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 40, isUnsigned: true)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 41, isUnsigned: true)
!51 = !DIEnumerator(name: "K_OBJ_LAST", value: 42, isUnsigned: true)
!52 = !{!53, !58, !62, !59, !63}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !54, line: 46, baseType: !55)
!54 = !DIFile(filename: "zephyrproject/zephyr/include/sys_clock.h", directory: "/home/kenny")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 43, baseType: !57)
!56 = !DIFile(filename: "zephyrproject/zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/kenny")
!57 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_data_t", file: !6, line: 2893, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !56, line: 71, baseType: !61)
!61 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !{!65, !76, !205, !0}
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "worker_stack_area", scope: !2, file: !67, line: 8, type: !68, isLocal: false, isDefinition: true, align: 64)
!67 = !DIFile(filename: "appl/Zephyr/dyn_stack/src/main.c", directory: "/home/kenny/ara")
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8192, elements: !74)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !70, line: 35, size: 8, elements: !71)
!70 = !DIFile(filename: "zephyrproject/zephyr/include/sys/thread_stack.h", directory: "/home/kenny")
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !69, file: !70, line: 36, baseType: !73, size: 8)
!73 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!74 = !{!75}
!75 = !DISubrange(count: 1024)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "worker", scope: !2, file: !67, line: 9, type: !78, isLocal: false, isDefinition: true)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !6, line: 570, size: 1024, elements: !79)
!79 = !{!80, !151, !164, !165, !169, !170, !178, !200}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !78, file: !6, line: 572, baseType: !81, size: 448)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !6, line: 441, size: 448, elements: !82)
!82 = !{!83, !111, !119, !121, !122, !135, !138, !139, !150}
!83 = !DIDerivedType(tag: DW_TAG_member, scope: !81, file: !6, line: 444, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !81, file: !6, line: 444, size: 64, elements: !85)
!85 = !{!86, !102}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !84, file: !6, line: 445, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !88, line: 43, baseType: !89)
!88 = !DIFile(filename: "zephyrproject/zephyr/include/sys/dlist.h", directory: "/home/kenny")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !88, line: 31, size: 64, elements: !90)
!90 = !{!91, !97}
!91 = !DIDerivedType(tag: DW_TAG_member, scope: !89, file: !88, line: 32, baseType: !92, size: 32)
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !89, file: !88, line: 32, size: 32, elements: !93)
!93 = !{!94, !96}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !92, file: !88, line: 33, baseType: !95, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !92, file: !88, line: 34, baseType: !95, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, scope: !89, file: !88, line: 36, baseType: !98, size: 32, offset: 32)
!98 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !89, file: !88, line: 36, size: 32, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !98, file: !88, line: 37, baseType: !95, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !98, file: !88, line: 38, baseType: !95, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !84, file: !6, line: 446, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !104, line: 48, size: 64, elements: !105)
!104 = !DIFile(filename: "zephyrproject/zephyr/include/sys/rb.h", directory: "/home/kenny")
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !103, file: !104, line: 49, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 64, elements: !109)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!109 = !{!110}
!110 = !DISubrange(count: 2)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !81, file: !6, line: 452, baseType: !112, size: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !114, line: 210, baseType: !115)
!114 = !DIFile(filename: "zephyrproject/zephyr/include/kernel_structs.h", directory: "/home/kenny")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 208, size: 64, elements: !116)
!116 = !{!117}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !115, file: !114, line: 209, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !88, line: 42, baseType: !89)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !81, file: !6, line: 455, baseType: !120, size: 8, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !56, line: 55, baseType: !7)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !81, file: !6, line: 458, baseType: !120, size: 8, offset: 104)
!122 = !DIDerivedType(tag: DW_TAG_member, scope: !81, file: !6, line: 474, baseType: !123, size: 16, offset: 112)
!123 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !81, file: !6, line: 474, size: 16, elements: !124)
!124 = !{!125, !132}
!125 = !DIDerivedType(tag: DW_TAG_member, scope: !123, file: !6, line: 475, baseType: !126, size: 16)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !123, file: !6, line: 475, size: 16, elements: !127)
!127 = !{!128, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !126, file: !6, line: 480, baseType: !129, size: 8)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !56, line: 40, baseType: !130)
!130 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !126, file: !6, line: 481, baseType: !120, size: 8, offset: 8)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !123, file: !6, line: 484, baseType: !133, size: 16)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !56, line: 56, baseType: !134)
!134 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !81, file: !6, line: 491, baseType: !136, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !56, line: 57, baseType: !137)
!137 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !81, file: !6, line: 511, baseType: !62, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !81, file: !6, line: 515, baseType: !140, size: 192, offset: 192)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !114, line: 221, size: 192, elements: !141)
!141 = !{!142, !143, !149}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !140, file: !114, line: 222, baseType: !87, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !140, file: !114, line: 223, baseType: !144, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !114, line: 219, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !140, file: !114, line: 226, baseType: !55, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "join_waiters", scope: !81, file: !6, line: 518, baseType: !113, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !78, file: !6, line: 575, baseType: !152, size: 288, offset: 448)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !153, line: 25, size: 288, elements: !154)
!153 = !DIFile(filename: "zephyrproject/zephyr/include/arch/arm/aarch32/thread.h", directory: "/home/kenny")
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !152, file: !153, line: 26, baseType: !136, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !152, file: !153, line: 27, baseType: !136, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !152, file: !153, line: 28, baseType: !136, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !152, file: !153, line: 29, baseType: !136, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !152, file: !153, line: 30, baseType: !136, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !152, file: !153, line: 31, baseType: !136, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !152, file: !153, line: 32, baseType: !136, size: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !152, file: !153, line: 33, baseType: !136, size: 32, offset: 224)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !152, file: !153, line: 34, baseType: !136, size: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !78, file: !6, line: 578, baseType: !62, size: 32, offset: 736)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fn_abort", scope: !78, file: !6, line: 583, baseType: !166, size: 32, offset: 768)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{null}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !78, file: !6, line: 610, baseType: !63, size: 32, offset: 800)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !78, file: !6, line: 616, baseType: !171, size: 96, offset: 832)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !6, line: 525, size: 96, elements: !172)
!172 = !{!173, !174, !177}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !171, file: !6, line: 529, baseType: !60, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !171, file: !6, line: 538, baseType: !175, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !176, line: 46, baseType: !137)
!176 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!177 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !171, file: !6, line: 544, baseType: !175, size: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !78, file: !6, line: 641, baseType: !179, size: 32, offset: 928)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_pool", file: !181, line: 30, size: 32, elements: !182)
!181 = !DIFile(filename: "zephyrproject/zephyr/include/mempool_heap.h", directory: "/home/kenny")
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !180, file: !181, line: 31, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !114, line: 267, size: 160, elements: !186)
!186 = !{!187, !196, !197}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !185, file: !114, line: 268, baseType: !188, size: 96)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !189, line: 51, size: 96, elements: !190)
!189 = !DIFile(filename: "zephyrproject/zephyr/include/sys/sys_heap.h", directory: "/home/kenny")
!190 = !{!191, !194, !195}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !188, file: !189, line: 52, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !189, line: 52, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !188, file: !189, line: 53, baseType: !62, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !188, file: !189, line: 54, baseType: !175, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !185, file: !114, line: 269, baseType: !113, size: 64, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !185, file: !114, line: 270, baseType: !198, offset: 160)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !114, line: 234, elements: !199)
!199 = !{}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !78, file: !6, line: 644, baseType: !201, size: 64, offset: 960)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !153, line: 60, size: 64, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !201, file: !153, line: 63, baseType: !136, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !201, file: !153, line: 66, baseType: !136, size: 32, offset: 32)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "work", scope: !2, file: !67, line: 11, type: !207, isLocal: false, isDefinition: true)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_stack", file: !6, line: 2895, size: 192, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !207, file: !6, line: 2896, baseType: !113, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !207, file: !6, line: 2897, baseType: !198, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !207, file: !6, line: 2898, baseType: !58, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !6, line: 2898, baseType: !58, size: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !207, file: !6, line: 2898, baseType: !58, size: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !207, file: !6, line: 2902, baseType: !120, size: 8, offset: 160)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !6, line: 3589, size: 160, elements: !216)
!216 = !{!217, !218, !220, !221}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !215, file: !6, line: 3591, baseType: !113, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !215, file: !6, line: 3593, baseType: !219, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !215, file: !6, line: 3596, baseType: !136, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !215, file: !6, line: 3599, baseType: !63, size: 32, offset: 128)
!222 = !{!"clang version 9.0.1-12 "}
!223 = !{i32 2, !"Dwarf Version", i32 4}
!224 = !{i32 2, !"Debug Info Version", i32 3}
!225 = !{i32 1, !"wchar_size", i32 4}
!226 = !{i32 1, !"min_enum_size", i32 1}
!227 = distinct !DISubprogram(name: "do_work", scope: !67, file: !67, line: 15, type: !228, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !199)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !62, !62, !62}
!230 = !DILocalVariable(name: "a", arg: 1, scope: !227, file: !67, line: 15, type: !62)
!231 = !DILocation(line: 15, column: 20, scope: !227)
!232 = !DILocalVariable(name: "b", arg: 2, scope: !227, file: !67, line: 15, type: !62)
!233 = !DILocation(line: 15, column: 29, scope: !227)
!234 = !DILocalVariable(name: "c", arg: 3, scope: !227, file: !67, line: 15, type: !62)
!235 = !DILocation(line: 15, column: 38, scope: !227)
!236 = !DILocalVariable(name: "done", scope: !227, file: !67, line: 16, type: !63)
!237 = !DILocation(line: 16, column: 9, scope: !227)
!238 = !DILocation(line: 17, column: 5, scope: !227)
!239 = !DILocalVariable(name: "w", scope: !240, file: !67, line: 18, type: !63)
!240 = distinct !DILexicalBlock(scope: !227, file: !67, line: 17, column: 17)
!241 = !DILocation(line: 18, column: 13, scope: !240)
!242 = !DILocation(line: 19, column: 30, scope: !240)
!243 = !DILocation(line: 19, column: 9, scope: !240)
!244 = !DILocation(line: 20, column: 43, scope: !240)
!245 = !DILocation(line: 20, column: 28, scope: !240)
!246 = !DILocation(line: 20, column: 46, scope: !240)
!247 = !DILocation(line: 20, column: 9, scope: !240)
!248 = !DILocation(line: 21, column: 9, scope: !240)
!249 = !DILocation(line: 22, column: 17, scope: !240)
!250 = !DILocation(line: 22, column: 14, scope: !240)
!251 = distinct !{!251, !238, !252}
!252 = !DILocation(line: 23, column: 5, scope: !227)
!253 = distinct !DISubprogram(name: "k_mutex_lock", scope: !254, file: !254, line: 705, type: !255, scopeLine: 706, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !199)
!254 = !DIFile(filename: "zephyr/include/generated/syscalls/kernel.h", directory: "/home/kenny/ara/build/appl/Zephyr/dyn_stack")
!255 = !DISubroutineType(types: !256)
!256 = !{!63, !257, !258}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !54, line: 69, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 67, size: 64, elements: !260)
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !259, file: !54, line: 68, baseType: !53, size: 64)
!262 = !DILocalVariable(name: "mutex", arg: 1, scope: !253, file: !254, line: 705, type: !257)
!263 = !DILocation(line: 705, column: 67, scope: !253)
!264 = !DILocalVariable(name: "timeout", arg: 2, scope: !253, file: !254, line: 705, type: !258)
!265 = !DILocation(line: 705, column: 86, scope: !253)
!266 = !DILocation(line: 714, column: 2, scope: !253)
!267 = !DILocation(line: 714, column: 2, scope: !268)
!268 = distinct !DILexicalBlock(scope: !253, file: !254, line: 714, column: 2)
!269 = !{i32 -2141855262}
!270 = !DILocation(line: 715, column: 29, scope: !253)
!271 = !DILocation(line: 715, column: 9, scope: !253)
!272 = !DILocation(line: 715, column: 2, scope: !253)
!273 = distinct !DISubprogram(name: "k_stack_pop", scope: !254, file: !254, line: 677, type: !274, scopeLine: 678, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !199)
!274 = !DISubroutineType(types: !275)
!275 = !{!63, !276, !58, !258}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!277 = !DILocalVariable(name: "stack", arg: 1, scope: !273, file: !254, line: 677, type: !276)
!278 = !DILocation(line: 677, column: 66, scope: !273)
