; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.z_thread_stack_element = type { i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, void ()*, i32, %struct._thread_stack_info, %struct.k_mem_pool*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout, %struct._wait_q_t }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_mem_pool = type { %struct.k_heap* }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.k_timeout_t = type { i64 }

@threadB_sem = dso_local global %struct.k_sem zeroinitializer, align 4, !dbg !0
@threadA_sem = dso_local global %struct.k_sem zeroinitializer, align 4, !dbg !63

!14 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "K_OBJ_SEM", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "K_OBJ_STACK", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17, isUnsigned: true)
!27 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18, isUnsigned: true)
!28 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 19, isUnsigned: true)
!29 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 20, isUnsigned: true)
!30 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 21, isUnsigned: true)
!31 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 22, isUnsigned: true)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 23, isUnsigned: true)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 24, isUnsigned: true)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 25, isUnsigned: true)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 26, isUnsigned: true)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 27, isUnsigned: true)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 28, isUnsigned: true)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 29, isUnsigned: true)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 30, isUnsigned: true)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 31, isUnsigned: true)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 32, isUnsigned: true)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 33, isUnsigned: true)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 34, isUnsigned: true)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 35, isUnsigned: true)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 36, isUnsigned: true)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 37, isUnsigned: true)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 38, isUnsigned: true)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 39, isUnsigned: true)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 40, isUnsigned: true)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 41, isUnsigned: true)
!51 = !DIEnumerator(name: "K_OBJ_LAST", value: 42, isUnsigned: true)
!52 = !{!53, !58, !59, !60}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !54, line: 46, baseType: !55)
!54 = !DIFile(filename: "zephyrproject/zephyr/include/sys_clock.h", directory: "/home/kenny")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 43, baseType: !57)
!56 = !DIFile(filename: "zephyrproject/zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/kenny")
!57 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !56, line: 57, baseType: !61)
!61 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!62 = !{!63, !0, !91, !101, !210, !212}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "threadA_sem", scope: !2, file: !65, line: 39, type: !66, isLocal: false, isDefinition: true)
!65 = !DIFile(filename: "appl/Zephyr/dyn_sems/src/main.c", directory: "/home/kenny/ara")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !6, line: 3704, size: 128, elements: !67)
!67 = !{!68, !89, !90}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !66, file: !6, line: 3705, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !70, line: 210, baseType: !71)
!70 = !DIFile(filename: "zephyrproject/zephyr/include/kernel_structs.h", directory: "/home/kenny")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 208, size: 64, elements: !72)
!72 = !{!73}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !71, file: !70, line: 209, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !75, line: 42, baseType: !76)
!75 = !DIFile(filename: "zephyrproject/zephyr/include/sys/dlist.h", directory: "/home/kenny")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !75, line: 31, size: 64, elements: !77)
!77 = !{!78, !84}
!78 = !DIDerivedType(tag: DW_TAG_member, scope: !76, file: !75, line: 32, baseType: !79, size: 32)
!79 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !76, file: !75, line: 32, size: 32, elements: !80)
!80 = !{!81, !83}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !79, file: !75, line: 33, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !79, file: !75, line: 34, baseType: !82, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, scope: !76, file: !75, line: 36, baseType: !85, size: 32, offset: 32)
!85 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !76, file: !75, line: 36, size: 32, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !85, file: !75, line: 37, baseType: !82, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !85, file: !75, line: 38, baseType: !82, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !66, file: !6, line: 3706, baseType: !60, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !66, file: !6, line: 3707, baseType: !60, size: 32, offset: 96)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "threadB_stack_area", scope: !2, file: !65, line: 50, type: !93, isLocal: false, isDefinition: true, align: 64)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 8192, elements: !99)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !95, line: 35, size: 8, elements: !96)
!95 = !DIFile(filename: "zephyrproject/zephyr/include/sys/thread_stack.h", directory: "/home/kenny")
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !94, file: !95, line: 36, baseType: !98, size: 8)
!98 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!99 = !{!100}
!100 = !DISubrange(count: 1024)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "threadB_data", scope: !2, file: !65, line: 51, type: !103, isLocal: true, isDefinition: true)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !6, line: 570, size: 1024, elements: !104)
!104 = !{!105, !154, !167, !168, !172, !173, !183, !205}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !103, file: !6, line: 572, baseType: !106, size: 448)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !6, line: 441, size: 448, elements: !107)
!107 = !{!108, !122, !124, !126, !127, !140, !141, !142, !153}
!108 = !DIDerivedType(tag: DW_TAG_member, scope: !106, file: !6, line: 444, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !106, file: !6, line: 444, size: 64, elements: !110)
!110 = !{!111, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !109, file: !6, line: 445, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !75, line: 43, baseType: !76)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !109, file: !6, line: 446, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !115, line: 48, size: 64, elements: !116)
!115 = !DIFile(filename: "zephyrproject/zephyr/include/sys/rb.h", directory: "/home/kenny")
!116 = !{!117}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !114, file: !115, line: 49, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 64, elements: !120)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!120 = !{!121}
!121 = !DISubrange(count: 2)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !106, file: !6, line: 452, baseType: !123, size: 32, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !106, file: !6, line: 455, baseType: !125, size: 8, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !56, line: 55, baseType: !7)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !106, file: !6, line: 458, baseType: !125, size: 8, offset: 104)
!127 = !DIDerivedType(tag: DW_TAG_member, scope: !106, file: !6, line: 474, baseType: !128, size: 16, offset: 112)
!128 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !106, file: !6, line: 474, size: 16, elements: !129)
!129 = !{!130, !137}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !6, line: 475, baseType: !131, size: 16)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !128, file: !6, line: 475, size: 16, elements: !132)
!132 = !{!133, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !131, file: !6, line: 480, baseType: !134, size: 8)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !56, line: 40, baseType: !135)
!135 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !131, file: !6, line: 481, baseType: !125, size: 8, offset: 8)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !128, file: !6, line: 484, baseType: !138, size: 16)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !56, line: 56, baseType: !139)
!139 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !106, file: !6, line: 491, baseType: !60, size: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !106, file: !6, line: 511, baseType: !58, size: 32, offset: 160)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !106, file: !6, line: 515, baseType: !143, size: 192, offset: 192)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !70, line: 221, size: 192, elements: !144)
!144 = !{!145, !146, !152}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !143, file: !70, line: 222, baseType: !112, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !143, file: !70, line: 223, baseType: !147, size: 32, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !70, line: 219, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !143, file: !70, line: 226, baseType: !55, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "join_waiters", scope: !106, file: !6, line: 518, baseType: !69, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !103, file: !6, line: 575, baseType: !155, size: 288, offset: 448)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !156, line: 25, size: 288, elements: !157)
!156 = !DIFile(filename: "zephyrproject/zephyr/include/arch/arm/aarch32/thread.h", directory: "/home/kenny")
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !155, file: !156, line: 26, baseType: !60, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !155, file: !156, line: 27, baseType: !60, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !155, file: !156, line: 28, baseType: !60, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !155, file: !156, line: 29, baseType: !60, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !155, file: !156, line: 30, baseType: !60, size: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !155, file: !156, line: 31, baseType: !60, size: 32, offset: 160)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !155, file: !156, line: 32, baseType: !60, size: 32, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !155, file: !156, line: 33, baseType: !60, size: 32, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !155, file: !156, line: 34, baseType: !60, size: 32, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !103, file: !6, line: 578, baseType: !58, size: 32, offset: 736)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "fn_abort", scope: !103, file: !6, line: 583, baseType: !169, size: 32, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DISubroutineType(types: !171)
!171 = !{null}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !103, file: !6, line: 610, baseType: !59, size: 32, offset: 800)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !103, file: !6, line: 616, baseType: !174, size: 96, offset: 832)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !6, line: 525, size: 96, elements: !175)
!175 = !{!176, !179, !182}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !174, file: !6, line: 529, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !56, line: 71, baseType: !178)
!178 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !174, file: !6, line: 538, baseType: !180, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !181, line: 46, baseType: !61)
!181 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!182 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !174, file: !6, line: 544, baseType: !180, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !103, file: !6, line: 641, baseType: !184, size: 32, offset: 928)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_pool", file: !186, line: 30, size: 32, elements: !187)
!186 = !DIFile(filename: "zephyrproject/zephyr/include/mempool_heap.h", directory: "/home/kenny")
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !185, file: !186, line: 31, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !70, line: 267, size: 160, elements: !191)
!191 = !{!192, !201, !202}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !190, file: !70, line: 268, baseType: !193, size: 96)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !194, line: 51, size: 96, elements: !195)
!194 = !DIFile(filename: "zephyrproject/zephyr/include/sys/sys_heap.h", directory: "/home/kenny")
!195 = !{!196, !199, !200}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !193, file: !194, line: 52, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !194, line: 52, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !193, file: !194, line: 53, baseType: !58, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !193, file: !194, line: 54, baseType: !180, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !190, file: !70, line: 269, baseType: !69, size: 64, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !190, file: !70, line: 270, baseType: !203, offset: 160)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !70, line: 234, elements: !204)
!204 = !{}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !103, file: !6, line: 644, baseType: !206, size: 64, offset: 960)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !156, line: 60, size: 64, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !206, file: !156, line: 63, baseType: !60, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !206, file: !156, line: 66, baseType: !60, size: 32, offset: 32)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "threadA_stack_area", scope: !2, file: !65, line: 73, type: !93, isLocal: false, isDefinition: true, align: 64)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "threadA_data", scope: !2, file: !65, line: 74, type: !103, isLocal: false, isDefinition: true)
!214 = !{!"clang version 9.0.1-12 "}
!215 = !{i32 2, !"Dwarf Version", i32 4}
!216 = !{i32 2, !"Debug Info Version", i32 3}
!217 = !{i32 1, !"wchar_size", i32 4}
!218 = !{i32 1, !"min_enum_size", i32 1}
!219 = distinct !DISubprogram(name: "helloLoop", scope: !65, file: !65, line: 17, type: !220, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !204)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222, !224, !224}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!225 = !DILocalVariable(name: "my_name", arg: 1, scope: !219, file: !65, line: 17, type: !222)
!226 = !DILocation(line: 17, column: 28, scope: !219)
!227 = !DILocalVariable(name: "my_sem", arg: 2, scope: !219, file: !65, line: 18, type: !224)
!228 = !DILocation(line: 18, column: 23, scope: !219)
!229 = !DILocalVariable(name: "other_sem", arg: 3, scope: !219, file: !65, line: 18, type: !224)
!230 = !DILocation(line: 18, column: 45, scope: !219)
!231 = !DILocalVariable(name: "tname", scope: !219, file: !65, line: 20, type: !222)
!232 = !DILocation(line: 20, column: 17, scope: !219)
!233 = !DILocation(line: 22, column: 5, scope: !219)
!234 = !DILocation(line: 23, column: 20, scope: !235)
!235 = distinct !DILexicalBlock(scope: !219, file: !65, line: 22, column: 15)
!236 = !DILocation(line: 23, column: 28, scope: !235)
!237 = !DILocation(line: 23, column: 9, scope: !235)
!238 = !DILocation(line: 25, column: 35, scope: !235)
!239 = !DILocation(line: 25, column: 17, scope: !235)
!240 = !DILocation(line: 25, column: 15, scope: !235)
!241 = !DILocation(line: 26, column: 13, scope: !242)
!242 = distinct !DILexicalBlock(scope: !235, file: !65, line: 26, column: 13)
!243 = !DILocation(line: 26, column: 19, scope: !242)
!244 = !DILocation(line: 26, column: 27, scope: !242)
!245 = !DILocation(line: 26, column: 30, scope: !242)
!246 = !DILocation(line: 26, column: 39, scope: !242)
!247 = !DILocation(line: 26, column: 13, scope: !235)
!248 = !DILocation(line: 28, column: 25, scope: !249)
!249 = distinct !DILexicalBlock(scope: !242, file: !65, line: 26, column: 48)
!250 = !DILocation(line: 27, column: 13, scope: !249)
!251 = !DILocation(line: 29, column: 9, scope: !249)
!252 = !DILocation(line: 31, column: 21, scope: !253)
!253 = distinct !DILexicalBlock(scope: !242, file: !65, line: 29, column: 16)
!254 = !DILocation(line: 30, column: 13, scope: !253)
!255 = !DILocation(line: 34, column: 9, scope: !235)
!256 = !DILocation(line: 35, column: 20, scope: !235)
!257 = !DILocation(line: 35, column: 9, scope: !235)
!258 = distinct !{!258, !233, !259}
!259 = !DILocation(line: 36, column: 5, scope: !219)
!260 = distinct !DISubprogram(name: "k_sem_take", scope: !261, file: !261, line: 746, type: !262, scopeLine: 747, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!261 = !DIFile(filename: "zephyr/include/generated/syscalls/kernel.h", directory: "/home/kenny/ara/build/appl/Zephyr/dyn_sems")
!262 = !DISubroutineType(types: !263)
!263 = !{!59, !224, !264}
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !54, line: 69, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 67, size: 64, elements: !266)
!266 = !{!267}
