; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct.sys_sem = type { %struct.k_sem }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.z_thread_stack_element = type { i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, void ()*, i32, %struct._thread_stack_info, %struct.k_mem_pool*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout, %struct._wait_q_t }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_mem_pool = type { %struct.k_heap* }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.k_timeout_t = type { i64 }

@threadB_sem = dso_local global %struct.sys_sem zeroinitializer, align 4, !dbg !0
@threadA_sem = dso_local global %struct.sys_sem zeroinitializer, align 4, !dbg !63

!19 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17, isUnsigned: true)
!27 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18, isUnsigned: true)
!28 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 19, isUnsigned: true)
!29 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 20, isUnsigned: true)
!30 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 21, isUnsigned: true)
!31 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 22, isUnsigned: true)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 23, isUnsigned: true)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 24, isUnsigned: true)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 25, isUnsigned: true)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 26, isUnsigned: true)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 27, isUnsigned: true)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 28, isUnsigned: true)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 29, isUnsigned: true)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 30, isUnsigned: true)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 31, isUnsigned: true)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 32, isUnsigned: true)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 33, isUnsigned: true)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 34, isUnsigned: true)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 35, isUnsigned: true)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 36, isUnsigned: true)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 37, isUnsigned: true)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 38, isUnsigned: true)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 39, isUnsigned: true)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 40, isUnsigned: true)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 41, isUnsigned: true)
!51 = !DIEnumerator(name: "K_OBJ_LAST", value: 42, isUnsigned: true)
!52 = !{!53, !58, !59, !60}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !54, line: 46, baseType: !55)
!54 = !DIFile(filename: "zephyrproject/zephyr/include/sys_clock.h", directory: "/home/kenny")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 43, baseType: !57)
!56 = !DIFile(filename: "zephyrproject/zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/kenny")
!57 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !56, line: 57, baseType: !61)
!61 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!62 = !{!63, !0, !95, !105, !214, !216}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "threadA_sem", scope: !2, file: !65, line: 40, type: !66, isLocal: false, isDefinition: true)
!65 = !DIFile(filename: "appl/Zephyr/dyn_sys_sems/src/main.c", directory: "/home/kenny/ara")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_sem", file: !67, line: 33, size: 128, elements: !68)
!67 = !DIFile(filename: "zephyrproject/zephyr/include/sys/sem.h", directory: "/home/kenny")
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_sem", scope: !66, file: !67, line: 38, baseType: !70, size: 128)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !6, line: 3704, size: 128, elements: !71)
!71 = !{!72, !93, !94}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !70, file: !6, line: 3705, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !74, line: 210, baseType: !75)
!74 = !DIFile(filename: "zephyrproject/zephyr/include/kernel_structs.h", directory: "/home/kenny")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 208, size: 64, elements: !76)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !75, file: !74, line: 209, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !79, line: 42, baseType: !80)
!79 = !DIFile(filename: "zephyrproject/zephyr/include/sys/dlist.h", directory: "/home/kenny")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !79, line: 31, size: 64, elements: !81)
!81 = !{!82, !88}
!82 = !DIDerivedType(tag: DW_TAG_member, scope: !80, file: !79, line: 32, baseType: !83, size: 32)
!83 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !80, file: !79, line: 32, size: 32, elements: !84)
!84 = !{!85, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !83, file: !79, line: 33, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !79, line: 34, baseType: !86, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, scope: !80, file: !79, line: 36, baseType: !89, size: 32, offset: 32)
!89 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !80, file: !79, line: 36, size: 32, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !89, file: !79, line: 37, baseType: !86, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !89, file: !79, line: 38, baseType: !86, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !70, file: !6, line: 3706, baseType: !60, size: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !70, file: !6, line: 3707, baseType: !60, size: 32, offset: 96)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "threadB_stack_area", scope: !2, file: !65, line: 51, type: !97, isLocal: false, isDefinition: true, align: 64)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 8192, elements: !103)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !99, line: 35, size: 8, elements: !100)
!99 = !DIFile(filename: "zephyrproject/zephyr/include/sys/thread_stack.h", directory: "/home/kenny")
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !98, file: !99, line: 36, baseType: !102, size: 8)
!102 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!103 = !{!104}
!104 = !DISubrange(count: 1024)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "threadB_data", scope: !2, file: !65, line: 52, type: !107, isLocal: true, isDefinition: true)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !6, line: 570, size: 1024, elements: !108)
!108 = !{!109, !158, !171, !172, !176, !177, !187, !209}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !107, file: !6, line: 572, baseType: !110, size: 448)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !6, line: 441, size: 448, elements: !111)
!111 = !{!112, !126, !128, !130, !131, !144, !145, !146, !157}
!112 = !DIDerivedType(tag: DW_TAG_member, scope: !110, file: !6, line: 444, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !6, line: 444, size: 64, elements: !114)
!114 = !{!115, !117}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !113, file: !6, line: 445, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !79, line: 43, baseType: !80)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !113, file: !6, line: 446, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !119, line: 48, size: 64, elements: !120)
!119 = !DIFile(filename: "zephyrproject/zephyr/include/sys/rb.h", directory: "/home/kenny")
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !118, file: !119, line: 49, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 64, elements: !124)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!124 = !{!125}
!125 = !DISubrange(count: 2)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !110, file: !6, line: 452, baseType: !127, size: 32, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !110, file: !6, line: 455, baseType: !129, size: 8, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !56, line: 55, baseType: !7)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !110, file: !6, line: 458, baseType: !129, size: 8, offset: 104)
!131 = !DIDerivedType(tag: DW_TAG_member, scope: !110, file: !6, line: 474, baseType: !132, size: 16, offset: 112)
!132 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !6, line: 474, size: 16, elements: !133)
!133 = !{!134, !141}
!134 = !DIDerivedType(tag: DW_TAG_member, scope: !132, file: !6, line: 475, baseType: !135, size: 16)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !132, file: !6, line: 475, size: 16, elements: !136)
!136 = !{!137, !140}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !135, file: !6, line: 480, baseType: !138, size: 8)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !56, line: 40, baseType: !139)
!139 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !135, file: !6, line: 481, baseType: !129, size: 8, offset: 8)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !132, file: !6, line: 484, baseType: !142, size: 16)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !56, line: 56, baseType: !143)
!143 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !110, file: !6, line: 491, baseType: !60, size: 32, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !110, file: !6, line: 511, baseType: !58, size: 32, offset: 160)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !110, file: !6, line: 515, baseType: !147, size: 192, offset: 192)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !74, line: 221, size: 192, elements: !148)
!148 = !{!149, !150, !156}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !147, file: !74, line: 222, baseType: !116, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !147, file: !74, line: 223, baseType: !151, size: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !74, line: 219, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !147, file: !74, line: 226, baseType: !55, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "join_waiters", scope: !110, file: !6, line: 518, baseType: !73, size: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !107, file: !6, line: 575, baseType: !159, size: 288, offset: 448)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !160, line: 25, size: 288, elements: !161)
!160 = !DIFile(filename: "zephyrproject/zephyr/include/arch/arm/aarch32/thread.h", directory: "/home/kenny")
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169, !170}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !159, file: !160, line: 26, baseType: !60, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !159, file: !160, line: 27, baseType: !60, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !159, file: !160, line: 28, baseType: !60, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !159, file: !160, line: 29, baseType: !60, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !159, file: !160, line: 30, baseType: !60, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !159, file: !160, line: 31, baseType: !60, size: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !159, file: !160, line: 32, baseType: !60, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !159, file: !160, line: 33, baseType: !60, size: 32, offset: 224)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !159, file: !160, line: 34, baseType: !60, size: 32, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !107, file: !6, line: 578, baseType: !58, size: 32, offset: 736)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fn_abort", scope: !107, file: !6, line: 583, baseType: !173, size: 32, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DISubroutineType(types: !175)
!175 = !{null}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !107, file: !6, line: 610, baseType: !59, size: 32, offset: 800)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !107, file: !6, line: 616, baseType: !178, size: 96, offset: 832)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !6, line: 525, size: 96, elements: !179)
!179 = !{!180, !183, !186}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !178, file: !6, line: 529, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !56, line: 71, baseType: !182)
!182 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !178, file: !6, line: 538, baseType: !184, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !185, line: 46, baseType: !61)
!185 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !178, file: !6, line: 544, baseType: !184, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !107, file: !6, line: 641, baseType: !188, size: 32, offset: 928)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_pool", file: !190, line: 30, size: 32, elements: !191)
!190 = !DIFile(filename: "zephyrproject/zephyr/include/mempool_heap.h", directory: "/home/kenny")
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !189, file: !190, line: 31, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !74, line: 267, size: 160, elements: !195)
!195 = !{!196, !205, !206}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !194, file: !74, line: 268, baseType: !197, size: 96)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !198, line: 51, size: 96, elements: !199)
!198 = !DIFile(filename: "zephyrproject/zephyr/include/sys/sys_heap.h", directory: "/home/kenny")
!199 = !{!200, !203, !204}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !197, file: !198, line: 52, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !198, line: 52, flags: DIFlagFwdDecl)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !197, file: !198, line: 53, baseType: !58, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !197, file: !198, line: 54, baseType: !184, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !194, file: !74, line: 269, baseType: !73, size: 64, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !194, file: !74, line: 270, baseType: !207, offset: 160)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !74, line: 234, elements: !208)
!208 = !{}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !107, file: !6, line: 644, baseType: !210, size: 64, offset: 960)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !160, line: 60, size: 64, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !210, file: !160, line: 63, baseType: !60, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !210, file: !160, line: 66, baseType: !60, size: 32, offset: 32)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "threadA_stack_area", scope: !2, file: !65, line: 74, type: !97, isLocal: false, isDefinition: true, align: 64)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "threadA_data", scope: !2, file: !65, line: 75, type: !107, isLocal: false, isDefinition: true)
!218 = !{!"clang version 9.0.1-12 "}
!219 = !{i32 2, !"Dwarf Version", i32 4}
!220 = !{i32 2, !"Debug Info Version", i32 3}
!221 = !{i32 1, !"wchar_size", i32 4}
!222 = !{i32 1, !"min_enum_size", i32 1}
!223 = distinct !DISubprogram(name: "helloLoop", scope: !65, file: !65, line: 18, type: !224, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !208)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !226, !228, !228}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!229 = !DILocalVariable(name: "my_name", arg: 1, scope: !223, file: !65, line: 18, type: !226)
!230 = !DILocation(line: 18, column: 28, scope: !223)
!231 = !DILocalVariable(name: "my_sem", arg: 2, scope: !223, file: !65, line: 19, type: !228)
!232 = !DILocation(line: 19, column: 23, scope: !223)
!233 = !DILocalVariable(name: "other_sem", arg: 3, scope: !223, file: !65, line: 19, type: !228)
!234 = !DILocation(line: 19, column: 45, scope: !223)
!235 = !DILocalVariable(name: "tname", scope: !223, file: !65, line: 21, type: !226)
!236 = !DILocation(line: 21, column: 17, scope: !223)
!237 = !DILocation(line: 23, column: 5, scope: !223)
!238 = !DILocation(line: 24, column: 22, scope: !239)
!239 = distinct !DILexicalBlock(scope: !223, file: !65, line: 23, column: 15)
!240 = !DILocation(line: 24, column: 30, scope: !239)
!241 = !DILocation(line: 24, column: 9, scope: !239)
!242 = !DILocation(line: 26, column: 35, scope: !239)
!243 = !DILocation(line: 26, column: 17, scope: !239)
!244 = !DILocation(line: 26, column: 15, scope: !239)
!245 = !DILocation(line: 27, column: 13, scope: !246)
!246 = distinct !DILexicalBlock(scope: !239, file: !65, line: 27, column: 13)
!247 = !DILocation(line: 27, column: 19, scope: !246)
!248 = !DILocation(line: 27, column: 27, scope: !246)
!249 = !DILocation(line: 27, column: 30, scope: !246)
!250 = !DILocation(line: 27, column: 39, scope: !246)
!251 = !DILocation(line: 27, column: 13, scope: !239)
!252 = !DILocation(line: 29, column: 25, scope: !253)
!253 = distinct !DILexicalBlock(scope: !246, file: !65, line: 27, column: 48)
!254 = !DILocation(line: 28, column: 13, scope: !253)
!255 = !DILocation(line: 30, column: 9, scope: !253)
!256 = !DILocation(line: 32, column: 21, scope: !257)
!257 = distinct !DILexicalBlock(scope: !246, file: !65, line: 30, column: 16)
!258 = !DILocation(line: 31, column: 13, scope: !257)
!259 = !DILocation(line: 35, column: 9, scope: !239)
!260 = !DILocation(line: 36, column: 22, scope: !239)
!261 = !DILocation(line: 36, column: 9, scope: !239)
!262 = distinct !{!262, !237, !263}
!263 = !DILocation(line: 37, column: 5, scope: !223)
!264 = distinct !DISubprogram(name: "k_current_get", scope: !265, file: !265, line: 187, type: !266, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !208)
!265 = !DIFile(filename: "zephyr/include/generated/syscalls/kernel.h", directory: "/home/kenny/ara/build/appl/Zephyr/dyn_sys_sems")
!266 = !DISubroutineType(types: !267)
!267 = !{!268}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !6, line: 648, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!270 = !DILocation(line: 194, column: 2, scope: !264)
