; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, void ()*, i32, %struct._thread_stack_info, %struct.k_mem_pool*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout, %union.anon }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%union.anon = type { %struct._dnode }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_mem_pool = type { %struct.k_heap* }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct._static_thread_data = type { %struct.k_thread*, %struct.z_thread_stack_element*, i32, void (i8*, i8*, i8*)*, i8*, i8*, i8*, i32, i32, i32, void ()*, i8* }
%struct.k_timeout_t = type { i64 }

@_k_thread_obj_thread_a = dso_local global %struct.k_thread zeroinitializer, align 8, !dbg !0

!31 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 22, isUnsigned: true)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 23, isUnsigned: true)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 24, isUnsigned: true)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 25, isUnsigned: true)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 26, isUnsigned: true)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 27, isUnsigned: true)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 28, isUnsigned: true)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 29, isUnsigned: true)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 30, isUnsigned: true)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 31, isUnsigned: true)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 32, isUnsigned: true)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 33, isUnsigned: true)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 34, isUnsigned: true)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 35, isUnsigned: true)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 36, isUnsigned: true)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 37, isUnsigned: true)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 38, isUnsigned: true)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 39, isUnsigned: true)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 40, isUnsigned: true)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 41, isUnsigned: true)
!51 = !DIEnumerator(name: "K_OBJ_LAST", value: 42, isUnsigned: true)
!52 = !{!53, !54, !55, !60}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "zephyrproject/zephyr/include/sys_clock.h", directory: "/home/kenny")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !58, line: 43, baseType: !59)
!58 = !DIFile(filename: "zephyrproject/zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/kenny")
!59 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !58, line: 57, baseType: !61)
!61 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!62 = !{!63, !223, !227, !229, !231, !0, !236, !238}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_a", scope: !2, file: !65, line: 25, type: !66, isLocal: false, isDefinition: true, align: 32)
!65 = !DIFile(filename: "appl/Zephyr/static_threads/src/main.c", directory: "/home/kenny/ara")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !6, line: 1099, size: 384, elements: !67)
!67 = !{!68, !197, !206, !207, !212, !213, !214, !215, !216, !217, !219, !220}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !66, file: !6, line: 1100, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !6, line: 570, size: 1024, elements: !71)
!71 = !{!72, !141, !154, !155, !159, !160, !170, !192}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !70, file: !6, line: 572, baseType: !73, size: 448)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !6, line: 441, size: 448, elements: !74)
!74 = !{!75, !103, !111, !113, !114, !127, !128, !129, !140}
!75 = !DIDerivedType(tag: DW_TAG_member, scope: !73, file: !6, line: 444, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !73, file: !6, line: 444, size: 64, elements: !77)
!77 = !{!78, !94}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !76, file: !6, line: 445, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !80, line: 43, baseType: !81)
!80 = !DIFile(filename: "zephyrproject/zephyr/include/sys/dlist.h", directory: "/home/kenny")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !80, line: 31, size: 64, elements: !82)
!82 = !{!83, !89}
!83 = !DIDerivedType(tag: DW_TAG_member, scope: !81, file: !80, line: 32, baseType: !84, size: 32)
!84 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !81, file: !80, line: 32, size: 32, elements: !85)
!85 = !{!86, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !84, file: !80, line: 33, baseType: !87, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !84, file: !80, line: 34, baseType: !87, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, scope: !81, file: !80, line: 36, baseType: !90, size: 32, offset: 32)
!90 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !81, file: !80, line: 36, size: 32, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !90, file: !80, line: 37, baseType: !87, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !90, file: !80, line: 38, baseType: !87, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !76, file: !6, line: 446, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !96, line: 48, size: 64, elements: !97)
!96 = !DIFile(filename: "zephyrproject/zephyr/include/sys/rb.h", directory: "/home/kenny")
!97 = !{!98}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !95, file: !96, line: 49, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 64, elements: !101)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 32)
!101 = !{!102}
!102 = !DISubrange(count: 2)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !73, file: !6, line: 452, baseType: !104, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !106, line: 210, baseType: !107)
!106 = !DIFile(filename: "zephyrproject/zephyr/include/kernel_structs.h", directory: "/home/kenny")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 208, size: 64, elements: !108)
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !107, file: !106, line: 209, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !80, line: 42, baseType: !81)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !73, file: !6, line: 455, baseType: !112, size: 8, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !58, line: 55, baseType: !7)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !73, file: !6, line: 458, baseType: !112, size: 8, offset: 104)
!114 = !DIDerivedType(tag: DW_TAG_member, scope: !73, file: !6, line: 474, baseType: !115, size: 16, offset: 112)
!115 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !73, file: !6, line: 474, size: 16, elements: !116)
!116 = !{!117, !124}
!117 = !DIDerivedType(tag: DW_TAG_member, scope: !115, file: !6, line: 475, baseType: !118, size: 16)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !115, file: !6, line: 475, size: 16, elements: !119)
!119 = !{!120, !123}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !118, file: !6, line: 480, baseType: !121, size: 8)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !58, line: 40, baseType: !122)
!122 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !118, file: !6, line: 481, baseType: !112, size: 8, offset: 8)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !115, file: !6, line: 484, baseType: !125, size: 16)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !58, line: 56, baseType: !126)
!126 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !73, file: !6, line: 491, baseType: !60, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !73, file: !6, line: 511, baseType: !53, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !73, file: !6, line: 515, baseType: !130, size: 192, offset: 192)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !106, line: 221, size: 192, elements: !131)
!131 = !{!132, !133, !139}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !130, file: !106, line: 222, baseType: !79, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !130, file: !106, line: 223, baseType: !134, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !106, line: 219, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !130, file: !106, line: 226, baseType: !57, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "join_waiters", scope: !73, file: !6, line: 518, baseType: !105, size: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !70, file: !6, line: 575, baseType: !142, size: 288, offset: 448)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !143, line: 25, size: 288, elements: !144)
!143 = !DIFile(filename: "zephyrproject/zephyr/include/arch/arm/aarch32/thread.h", directory: "/home/kenny")
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !142, file: !143, line: 26, baseType: !60, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !142, file: !143, line: 27, baseType: !60, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !142, file: !143, line: 28, baseType: !60, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !142, file: !143, line: 29, baseType: !60, size: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !142, file: !143, line: 30, baseType: !60, size: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !142, file: !143, line: 31, baseType: !60, size: 32, offset: 160)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !142, file: !143, line: 32, baseType: !60, size: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !142, file: !143, line: 33, baseType: !60, size: 32, offset: 224)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !142, file: !143, line: 34, baseType: !60, size: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !70, file: !6, line: 578, baseType: !53, size: 32, offset: 736)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "fn_abort", scope: !70, file: !6, line: 583, baseType: !156, size: 32, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DISubroutineType(types: !158)
!158 = !{null}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !70, file: !6, line: 610, baseType: !54, size: 32, offset: 800)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !70, file: !6, line: 616, baseType: !161, size: 96, offset: 832)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !6, line: 525, size: 96, elements: !162)
!162 = !{!163, !166, !169}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !161, file: !6, line: 529, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !58, line: 71, baseType: !165)
!165 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !161, file: !6, line: 538, baseType: !167, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !168, line: 46, baseType: !61)
!168 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!169 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !161, file: !6, line: 544, baseType: !167, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !70, file: !6, line: 641, baseType: !171, size: 32, offset: 928)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_pool", file: !173, line: 30, size: 32, elements: !174)
!173 = !DIFile(filename: "zephyrproject/zephyr/include/mempool_heap.h", directory: "/home/kenny")
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !172, file: !173, line: 31, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !106, line: 267, size: 160, elements: !178)
!178 = !{!179, !188, !189}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !177, file: !106, line: 268, baseType: !180, size: 96)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !181, line: 51, size: 96, elements: !182)
!181 = !DIFile(filename: "zephyrproject/zephyr/include/sys/sys_heap.h", directory: "/home/kenny")
!182 = !{!183, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !180, file: !181, line: 52, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !181, line: 52, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !180, file: !181, line: 53, baseType: !53, size: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !180, file: !181, line: 54, baseType: !167, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !177, file: !106, line: 269, baseType: !105, size: 64, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !177, file: !106, line: 270, baseType: !190, offset: 160)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !106, line: 234, elements: !191)
!191 = !{}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !70, file: !6, line: 644, baseType: !193, size: 64, offset: 960)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !143, line: 60, size: 64, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !193, file: !143, line: 63, baseType: !60, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !193, file: !143, line: 66, baseType: !60, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !66, file: !6, line: 1101, baseType: !198, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !200, line: 44, baseType: !201)
!200 = !DIFile(filename: "zephyrproject/zephyr/include/sys/arch_interface.h", directory: "/home/kenny")
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !202, line: 35, size: 8, elements: !203)
!202 = !DIFile(filename: "zephyrproject/zephyr/include/sys/thread_stack.h", directory: "/home/kenny")
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !201, file: !202, line: 36, baseType: !205, size: 8)
!205 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !66, file: !6, line: 1102, baseType: !61, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !66, file: !6, line: 1103, baseType: !208, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !200, line: 46, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !53, !53, !53}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !66, file: !6, line: 1104, baseType: !53, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !66, file: !6, line: 1105, baseType: !53, size: 32, offset: 160)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !66, file: !6, line: 1106, baseType: !53, size: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !66, file: !6, line: 1107, baseType: !54, size: 32, offset: 224)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !66, file: !6, line: 1108, baseType: !60, size: 32, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !66, file: !6, line: 1109, baseType: !218, size: 32, offset: 288)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !58, line: 42, baseType: !54)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !66, file: !6, line: 1110, baseType: !156, size: 32, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !66, file: !6, line: 1111, baseType: !221, size: 32, offset: 352)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "thread_a", scope: !2, file: !65, line: 25, type: !225, isLocal: false, isDefinition: true)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !6, line: 648, baseType: !69)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_b", scope: !2, file: !65, line: 29, type: !66, isLocal: false, isDefinition: true, align: 32)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "thread_b", scope: !2, file: !65, line: 29, type: !225, isLocal: false, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_a", scope: !2, file: !65, line: 25, type: !233, isLocal: false, isDefinition: true, align: 64)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 8192, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 1024)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_b", scope: !2, file: !65, line: 29, type: !233, isLocal: false, isDefinition: true, align: 64)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_b", scope: !2, file: !65, line: 29, type: !70, isLocal: false, isDefinition: true)
!240 = !{!"clang version 9.0.1-12 "}
!241 = !{i32 2, !"Dwarf Version", i32 4}
!242 = !{i32 2, !"Debug Info Version", i32 3}
!243 = !{i32 1, !"wchar_size", i32 4}
!244 = !{i32 1, !"min_enum_size", i32 1}
!245 = distinct !DISubprogram(name: "do_stuff", scope: !65, file: !65, line: 12, type: !210, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !191)
!246 = !DILocalVariable(name: "dummy1", arg: 1, scope: !245, file: !65, line: 12, type: !53)
!247 = !DILocation(line: 12, column: 21, scope: !245)
!248 = !DILocalVariable(name: "dummy2", arg: 2, scope: !245, file: !65, line: 12, type: !53)
!249 = !DILocation(line: 12, column: 35, scope: !245)
!250 = !DILocalVariable(name: "dummy3", arg: 3, scope: !245, file: !65, line: 12, type: !53)
!251 = !DILocation(line: 12, column: 49, scope: !245)
!252 = !DILocation(line: 14, column: 2, scope: !245)
!253 = !DILocation(line: 15, column: 2, scope: !245)
!254 = !DILocation(line: 16, column: 2, scope: !245)
!255 = !DILocation(line: 17, column: 9, scope: !245)
!256 = !DILocation(line: 18, column: 9, scope: !245)
!257 = !DILocalVariable(name: "stuff", scope: !258, file: !65, line: 19, type: !259)
!258 = distinct !DILexicalBlock(scope: !245, file: !65, line: 18, column: 20)
!259 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !54)
!260 = !DILocation(line: 19, column: 26, scope: !258)
!261 = !DILocation(line: 20, column: 13, scope: !258)
!262 = !DILocation(line: 21, column: 13, scope: !258)
!263 = distinct !{!263, !256, !264}
!264 = !DILocation(line: 22, column: 9, scope: !245)
!265 = distinct !DISubprogram(name: "zephyr_dummy_syscall", scope: !65, file: !65, line: 10, type: !157, scopeLine: 10, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !191)
!266 = !DILocation(line: 10, column: 29, scope: !265)
!267 = distinct !DISubprogram(name: "k_msleep", scope: !6, file: !6, line: 957, type: !268, scopeLine: 958, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !191)
!268 = !DISubroutineType(types: !269)
!269 = !{!218, !218}
