; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct.k_stack = type { %struct._wait_q_t, %struct.k_spinlock, i32*, i32*, i32*, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, void ()*, i32, %struct._thread_stack_info, %struct.k_mem_pool*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout, %struct._wait_q_t }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_mem_pool = type { %struct.k_heap* }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.k_timeout_t = type { i64 }


!17 = !DIEnumerator(name: "K_OBJ_STACK", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17, isUnsigned: true)
!27 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18, isUnsigned: true)
!28 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 19, isUnsigned: true)
!29 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 20, isUnsigned: true)
!30 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 21, isUnsigned: true)
!31 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 22, isUnsigned: true)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 23, isUnsigned: true)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 24, isUnsigned: true)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 25, isUnsigned: true)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 26, isUnsigned: true)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 27, isUnsigned: true)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 28, isUnsigned: true)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 29, isUnsigned: true)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 30, isUnsigned: true)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 31, isUnsigned: true)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 32, isUnsigned: true)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 33, isUnsigned: true)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 34, isUnsigned: true)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 35, isUnsigned: true)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 36, isUnsigned: true)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 37, isUnsigned: true)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 38, isUnsigned: true)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 39, isUnsigned: true)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 40, isUnsigned: true)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 41, isUnsigned: true)
!51 = !DIEnumerator(name: "K_OBJ_LAST", value: 42, isUnsigned: true)
!52 = !{!53, !58, !59, !62, !63}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !54, line: 46, baseType: !55)
!54 = !DIFile(filename: "zephyrproject/zephyr/include/sys_clock.h", directory: "/home/kenny")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 43, baseType: !57)
!56 = !DIFile(filename: "zephyrproject/zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/kenny")
!57 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_data_t", file: !6, line: 2893, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !56, line: 71, baseType: !61)
!61 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !{!0, !65, !202, !215, !225, !227}
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "guard", scope: !2, file: !67, line: 15, type: !68, isLocal: false, isDefinition: true, align: 32)
!67 = !DIFile(filename: "appl/Zephyr/static_isr/src/main.c", directory: "/home/kenny/ara")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !6, line: 3589, size: 160, elements: !69)
!69 = !{!70, !91, !200, !201}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !68, file: !6, line: 3591, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !72, line: 210, baseType: !73)
!72 = !DIFile(filename: "zephyrproject/zephyr/include/kernel_structs.h", directory: "/home/kenny")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 208, size: 64, elements: !74)
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !73, file: !72, line: 209, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !77, line: 42, baseType: !78)
!77 = !DIFile(filename: "zephyrproject/zephyr/include/sys/dlist.h", directory: "/home/kenny")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !77, line: 31, size: 64, elements: !79)
!79 = !{!80, !86}
!80 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !77, line: 32, baseType: !81, size: 32)
!81 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !77, line: 32, size: 32, elements: !82)
!82 = !{!83, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !81, file: !77, line: 33, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !77, line: 34, baseType: !84, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !77, line: 36, baseType: !87, size: 32, offset: 32)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !77, line: 36, size: 32, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !87, file: !77, line: 37, baseType: !84, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !87, file: !77, line: 38, baseType: !84, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !68, file: !6, line: 3593, baseType: !92, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !6, line: 570, size: 1024, elements: !94)
!94 = !{!95, !146, !159, !160, !164, !165, !173, !195}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !93, file: !6, line: 572, baseType: !96, size: 448)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !6, line: 441, size: 448, elements: !97)
!97 = !{!98, !112, !114, !116, !117, !130, !133, !134, !145}
!98 = !DIDerivedType(tag: DW_TAG_member, scope: !96, file: !6, line: 444, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !96, file: !6, line: 444, size: 64, elements: !100)
!100 = !{!101, !103}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !99, file: !6, line: 445, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !77, line: 43, baseType: !78)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !99, file: !6, line: 446, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !105, line: 48, size: 64, elements: !106)
!105 = !DIFile(filename: "zephyrproject/zephyr/include/sys/rb.h", directory: "/home/kenny")
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !104, file: !105, line: 49, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !110)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!110 = !{!111}
!111 = !DISubrange(count: 2)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !96, file: !6, line: 452, baseType: !113, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !96, file: !6, line: 455, baseType: !115, size: 8, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !56, line: 55, baseType: !7)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !96, file: !6, line: 458, baseType: !115, size: 8, offset: 104)
!117 = !DIDerivedType(tag: DW_TAG_member, scope: !96, file: !6, line: 474, baseType: !118, size: 16, offset: 112)
!118 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !96, file: !6, line: 474, size: 16, elements: !119)
!119 = !{!120, !127}
!120 = !DIDerivedType(tag: DW_TAG_member, scope: !118, file: !6, line: 475, baseType: !121, size: 16)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !118, file: !6, line: 475, size: 16, elements: !122)
!122 = !{!123, !126}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !121, file: !6, line: 480, baseType: !124, size: 8)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !56, line: 40, baseType: !125)
!125 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !121, file: !6, line: 481, baseType: !115, size: 8, offset: 8)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !118, file: !6, line: 484, baseType: !128, size: 16)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !56, line: 56, baseType: !129)
!129 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !96, file: !6, line: 491, baseType: !131, size: 32, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !56, line: 57, baseType: !132)
!132 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !96, file: !6, line: 511, baseType: !62, size: 32, offset: 160)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !96, file: !6, line: 515, baseType: !135, size: 192, offset: 192)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !72, line: 221, size: 192, elements: !136)
!136 = !{!137, !138, !144}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !135, file: !72, line: 222, baseType: !102, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !135, file: !72, line: 223, baseType: !139, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !72, line: 219, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !135, file: !72, line: 226, baseType: !55, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "join_waiters", scope: !96, file: !6, line: 518, baseType: !71, size: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !93, file: !6, line: 575, baseType: !147, size: 288, offset: 448)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !148, line: 25, size: 288, elements: !149)
!148 = !DIFile(filename: "zephyrproject/zephyr/include/arch/arm/aarch32/thread.h", directory: "/home/kenny")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !147, file: !148, line: 26, baseType: !131, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !147, file: !148, line: 27, baseType: !131, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !147, file: !148, line: 28, baseType: !131, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !147, file: !148, line: 29, baseType: !131, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !147, file: !148, line: 30, baseType: !131, size: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !147, file: !148, line: 31, baseType: !131, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !147, file: !148, line: 32, baseType: !131, size: 32, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !147, file: !148, line: 33, baseType: !131, size: 32, offset: 224)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !147, file: !148, line: 34, baseType: !131, size: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !93, file: !6, line: 578, baseType: !62, size: 32, offset: 736)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "fn_abort", scope: !93, file: !6, line: 583, baseType: !161, size: 32, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{null}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !93, file: !6, line: 610, baseType: !63, size: 32, offset: 800)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !93, file: !6, line: 616, baseType: !166, size: 96, offset: 832)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !6, line: 525, size: 96, elements: !167)
!167 = !{!168, !169, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !166, file: !6, line: 529, baseType: !60, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !166, file: !6, line: 538, baseType: !170, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !171, line: 46, baseType: !132)
!171 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!172 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !166, file: !6, line: 544, baseType: !170, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !93, file: !6, line: 641, baseType: !174, size: 32, offset: 928)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_pool", file: !176, line: 30, size: 32, elements: !177)
!176 = !DIFile(filename: "zephyrproject/zephyr/include/mempool_heap.h", directory: "/home/kenny")
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !175, file: !176, line: 31, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !72, line: 267, size: 160, elements: !181)
!181 = !{!182, !191, !192}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !180, file: !72, line: 268, baseType: !183, size: 96)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !184, line: 51, size: 96, elements: !185)
!184 = !DIFile(filename: "zephyrproject/zephyr/include/sys/sys_heap.h", directory: "/home/kenny")
!185 = !{!186, !189, !190}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !183, file: !184, line: 52, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !184, line: 52, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !183, file: !184, line: 53, baseType: !62, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !183, file: !184, line: 54, baseType: !170, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !180, file: !72, line: 269, baseType: !71, size: 64, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !180, file: !72, line: 270, baseType: !193, offset: 160)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !72, line: 234, elements: !194)
!194 = !{}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !93, file: !6, line: 644, baseType: !196, size: 64, offset: 960)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !148, line: 60, size: 64, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !196, file: !148, line: 63, baseType: !131, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !196, file: !148, line: 66, baseType: !131, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !68, file: !6, line: 3596, baseType: !131, size: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !68, file: !6, line: 3599, baseType: !63, size: 32, offset: 128)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "__isr_produce_work_isr_irq_2", scope: !204, file: !67, line: 46, type: !205, isLocal: true, isDefinition: true, align: 32)
!204 = distinct !DISubprogram(name: "main", scope: !67, file: !67, line: 36, type: !162, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !194)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !206, line: 47, size: 128, elements: !207)
!206 = !DIFile(filename: "zephyrproject/zephyr/include/sw_isr_table.h", directory: "/home/kenny")
!207 = !{!208, !210, !211, !212}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !205, file: !206, line: 49, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !56, line: 42, baseType: !63)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !205, file: !206, line: 51, baseType: !209, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !205, file: !206, line: 53, baseType: !62, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !205, file: !206, line: 55, baseType: !213, size: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "worker_stack_area", scope: !2, file: !67, line: 10, type: !217, isLocal: false, isDefinition: true, align: 64)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 8192, elements: !223)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !219, line: 35, size: 8, elements: !220)
!219 = !DIFile(filename: "zephyrproject/zephyr/include/sys/thread_stack.h", directory: "/home/kenny")
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !218, file: !219, line: 36, baseType: !222, size: 8)
!222 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!223 = !{!224}
!224 = !DISubrange(count: 1024)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "worker", scope: !2, file: !67, line: 11, type: !93, isLocal: false, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "_k_stack_buf_work", scope: !2, file: !67, line: 13, type: !229, isLocal: false, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 8192, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 256)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_stack", file: !6, line: 2895, size: 192, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !239}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !232, file: !6, line: 2896, baseType: !71, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !232, file: !6, line: 2897, baseType: !193, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !232, file: !6, line: 2898, baseType: !58, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !6, line: 2898, baseType: !58, size: 32, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !232, file: !6, line: 2898, baseType: !58, size: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !232, file: !6, line: 2902, baseType: !115, size: 8, offset: 160)
!240 = !{!"clang version 9.0.1-12 "}
!241 = !{i32 2, !"Dwarf Version", i32 4}
!242 = !{i32 2, !"Debug Info Version", i32 3}
!243 = !{i32 1, !"wchar_size", i32 4}
!244 = !{i32 1, !"min_enum_size", i32 1}
!245 = distinct !DISubprogram(name: "produce_work_isr", scope: !67, file: !67, line: 28, type: !246, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !194)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !213}
!248 = !DILocalVariable(name: "args", arg: 1, scope: !245, file: !67, line: 28, type: !213)
!249 = !DILocation(line: 28, column: 35, scope: !245)
!250 = !DILocation(line: 30, column: 26, scope: !245)
!251 = !DILocation(line: 30, column: 5, scope: !245)
!252 = !DILocation(line: 31, column: 5, scope: !245)
!253 = !DILocation(line: 32, column: 5, scope: !245)
!254 = !DILocation(line: 33, column: 1, scope: !245)
!255 = distinct !DISubprogram(name: "k_mutex_lock", scope: !256, file: !256, line: 705, type: !257, scopeLine: 706, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !194)
!256 = !DIFile(filename: "zephyr/include/generated/syscalls/kernel.h", directory: "/home/kenny/ara/build/appl/Zephyr/static_isr")
!257 = !DISubroutineType(types: !258)
!258 = !{!63, !259, !260}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !54, line: 69, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 67, size: 64, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !261, file: !54, line: 68, baseType: !53, size: 64)
!264 = !DILocalVariable(name: "mutex", arg: 1, scope: !255, file: !256, line: 705, type: !259)
!265 = !DILocation(line: 705, column: 67, scope: !255)
!266 = !DILocalVariable(name: "timeout", arg: 2, scope: !255, file: !256, line: 705, type: !260)
!267 = !DILocation(line: 705, column: 86, scope: !255)
!268 = !DILocation(line: 714, column: 2, scope: !255)
!269 = !DILocation(line: 714, column: 2, scope: !270)
!270 = distinct !DILexicalBlock(scope: !255, file: !256, line: 714, column: 2)
!271 = !{i32 -2141854947}
!272 = !DILocation(line: 715, column: 29, scope: !255)
!273 = !DILocation(line: 715, column: 9, scope: !255)
!274 = !DILocation(line: 715, column: 2, scope: !255)
!275 = distinct !DISubprogram(name: "k_stack_push", scope: !256, file: !256, line: 664, type: !276, scopeLine: 665, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !194)
!276 = !DISubroutineType(types: !277)
!277 = !{!63, !278, !59}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!279 = !DILocalVariable(name: "stack", arg: 1, scope: !275, file: !256, line: 664, type: !278)
!280 = !DILocation(line: 664, column: 67, scope: !275)
!281 = !DILocalVariable(name: "data", arg: 2, scope: !275, file: !256, line: 664, type: !59)
!282 = !DILocation(line: 664, column: 87, scope: !275)
!283 = !DILocation(line: 671, column: 2, scope: !275)
!284 = !DILocation(line: 671, column: 2, scope: !285)
!285 = distinct !DILexicalBlock(scope: !275, file: !256, line: 671, column: 2)
!286 = !{i32 -2141855151}
!287 = !DILocation(line: 672, column: 29, scope: !275)
!288 = !DILocation(line: 672, column: 36, scope: !275)
!289 = !DILocation(line: 672, column: 9, scope: !275)
!290 = !DILocation(line: 672, column: 2, scope: !275)
!291 = distinct !DISubprogram(name: "k_mutex_unlock", scope: !256, file: !256, line: 720, type: !292, scopeLine: 721, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !194)
!292 = !DISubroutineType(types: !293)
!293 = !{!63, !259}
!294 = !DILocalVariable(name: "mutex", arg: 1, scope: !291, file: !256, line: 720, type: !259)
