; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct.sys_sem = type { %struct.k_sem }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.z_thread_stack_element = type { i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, void ()*, i32, %struct._thread_stack_info, %struct.k_mem_pool*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout, %struct._wait_q_t }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_mem_pool = type { %struct.k_heap* }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct._static_thread_data = type { %struct.k_thread*, %struct.z_thread_stack_element*, i32, void (i8*, i8*, i8*)*, i8*, i8*, i8*, i32, i32, i32, void ()*, i8* }
%struct.k_timeout_t = type { i64 }


!20 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17, isUnsigned: true)
!27 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18, isUnsigned: true)
!28 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 19, isUnsigned: true)
!29 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 20, isUnsigned: true)
!30 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 21, isUnsigned: true)
!31 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 22, isUnsigned: true)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 23, isUnsigned: true)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 24, isUnsigned: true)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 25, isUnsigned: true)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 26, isUnsigned: true)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 27, isUnsigned: true)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 28, isUnsigned: true)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 29, isUnsigned: true)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 30, isUnsigned: true)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 31, isUnsigned: true)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 32, isUnsigned: true)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 33, isUnsigned: true)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 34, isUnsigned: true)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 35, isUnsigned: true)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 36, isUnsigned: true)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 37, isUnsigned: true)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 38, isUnsigned: true)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 39, isUnsigned: true)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 40, isUnsigned: true)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 41, isUnsigned: true)
!51 = !DIEnumerator(name: "K_OBJ_LAST", value: 42, isUnsigned: true)
!52 = !{!53, !58, !59, !60}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !54, line: 46, baseType: !55)
!54 = !DIFile(filename: "zephyrproject/zephyr/include/sys_clock.h", directory: "/home/kenny")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 43, baseType: !57)
!56 = !DIFile(filename: "zephyrproject/zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/kenny")
!57 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !56, line: 57, baseType: !61)
!61 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!62 = !{!0, !63, !95, !234, !238, !243, !245, !247}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "threadB_sem", scope: !2, file: !65, line: 40, type: !66, isLocal: false, isDefinition: true, align: 32)
!65 = !DIFile(filename: "appl/Zephyr/static_sys_sems/src/main.c", directory: "/home/kenny/ara")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_sem", file: !67, line: 33, size: 128, elements: !68)
!67 = !DIFile(filename: "zephyrproject/zephyr/include/sys/sem.h", directory: "/home/kenny")
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_sem", scope: !66, file: !67, line: 38, baseType: !70, size: 128)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !6, line: 3704, size: 128, elements: !71)
!71 = !{!72, !93, !94}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !70, file: !6, line: 3705, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !74, line: 210, baseType: !75)
!74 = !DIFile(filename: "zephyrproject/zephyr/include/kernel_structs.h", directory: "/home/kenny")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 208, size: 64, elements: !76)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !75, file: !74, line: 209, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !79, line: 42, baseType: !80)
!79 = !DIFile(filename: "zephyrproject/zephyr/include/sys/dlist.h", directory: "/home/kenny")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !79, line: 31, size: 64, elements: !81)
!81 = !{!82, !88}
!82 = !DIDerivedType(tag: DW_TAG_member, scope: !80, file: !79, line: 32, baseType: !83, size: 32)
!83 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !80, file: !79, line: 32, size: 32, elements: !84)
!84 = !{!85, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !83, file: !79, line: 33, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !79, line: 34, baseType: !86, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, scope: !80, file: !79, line: 36, baseType: !89, size: 32, offset: 32)
!89 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !80, file: !79, line: 36, size: 32, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !89, file: !79, line: 37, baseType: !86, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !89, file: !79, line: 38, baseType: !86, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !70, file: !6, line: 3706, baseType: !60, size: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !70, file: !6, line: 3707, baseType: !60, size: 32, offset: 96)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_a", scope: !2, file: !65, line: 70, type: !97, isLocal: false, isDefinition: true, align: 32)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !6, line: 1099, size: 384, elements: !98)
!98 = !{!99, !208, !217, !218, !223, !224, !225, !226, !227, !228, !230, !231}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !97, file: !6, line: 1100, baseType: !100, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !6, line: 570, size: 1024, elements: !102)
!102 = !{!103, !152, !165, !166, !170, !171, !181, !203}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !101, file: !6, line: 572, baseType: !104, size: 448)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !6, line: 441, size: 448, elements: !105)
!105 = !{!106, !120, !122, !124, !125, !138, !139, !140, !151}
!106 = !DIDerivedType(tag: DW_TAG_member, scope: !104, file: !6, line: 444, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !104, file: !6, line: 444, size: 64, elements: !108)
!108 = !{!109, !111}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !107, file: !6, line: 445, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !79, line: 43, baseType: !80)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !107, file: !6, line: 446, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !113, line: 48, size: 64, elements: !114)
!113 = !DIFile(filename: "zephyrproject/zephyr/include/sys/rb.h", directory: "/home/kenny")
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !112, file: !113, line: 49, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 64, elements: !118)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!118 = !{!119}
!119 = !DISubrange(count: 2)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !104, file: !6, line: 452, baseType: !121, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !104, file: !6, line: 455, baseType: !123, size: 8, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !56, line: 55, baseType: !7)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !104, file: !6, line: 458, baseType: !123, size: 8, offset: 104)
!125 = !DIDerivedType(tag: DW_TAG_member, scope: !104, file: !6, line: 474, baseType: !126, size: 16, offset: 112)
!126 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !104, file: !6, line: 474, size: 16, elements: !127)
!127 = !{!128, !135}
!128 = !DIDerivedType(tag: DW_TAG_member, scope: !126, file: !6, line: 475, baseType: !129, size: 16)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !126, file: !6, line: 475, size: 16, elements: !130)
!130 = !{!131, !134}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !129, file: !6, line: 480, baseType: !132, size: 8)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !56, line: 40, baseType: !133)
!133 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !129, file: !6, line: 481, baseType: !123, size: 8, offset: 8)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !126, file: !6, line: 484, baseType: !136, size: 16)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !56, line: 56, baseType: !137)
!137 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !104, file: !6, line: 491, baseType: !60, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !104, file: !6, line: 511, baseType: !58, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !104, file: !6, line: 515, baseType: !141, size: 192, offset: 192)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !74, line: 221, size: 192, elements: !142)
!142 = !{!143, !144, !150}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !141, file: !74, line: 222, baseType: !110, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !141, file: !74, line: 223, baseType: !145, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !74, line: 219, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !141, file: !74, line: 226, baseType: !55, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "join_waiters", scope: !104, file: !6, line: 518, baseType: !73, size: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !101, file: !6, line: 575, baseType: !153, size: 288, offset: 448)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !154, line: 25, size: 288, elements: !155)
!154 = !DIFile(filename: "zephyrproject/zephyr/include/arch/arm/aarch32/thread.h", directory: "/home/kenny")
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !153, file: !154, line: 26, baseType: !60, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !153, file: !154, line: 27, baseType: !60, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !153, file: !154, line: 28, baseType: !60, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !153, file: !154, line: 29, baseType: !60, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !153, file: !154, line: 30, baseType: !60, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !153, file: !154, line: 31, baseType: !60, size: 32, offset: 160)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !153, file: !154, line: 32, baseType: !60, size: 32, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !153, file: !154, line: 33, baseType: !60, size: 32, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !153, file: !154, line: 34, baseType: !60, size: 32, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !101, file: !6, line: 578, baseType: !58, size: 32, offset: 736)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "fn_abort", scope: !101, file: !6, line: 583, baseType: !167, size: 32, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DISubroutineType(types: !169)
!169 = !{null}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !101, file: !6, line: 610, baseType: !59, size: 32, offset: 800)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !101, file: !6, line: 616, baseType: !172, size: 96, offset: 832)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !6, line: 525, size: 96, elements: !173)
!173 = !{!174, !177, !180}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !172, file: !6, line: 529, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !56, line: 71, baseType: !176)
!176 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !172, file: !6, line: 538, baseType: !178, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !179, line: 46, baseType: !61)
!179 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!180 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !172, file: !6, line: 544, baseType: !178, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !101, file: !6, line: 641, baseType: !182, size: 32, offset: 928)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_pool", file: !184, line: 30, size: 32, elements: !185)
!184 = !DIFile(filename: "zephyrproject/zephyr/include/mempool_heap.h", directory: "/home/kenny")
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !183, file: !184, line: 31, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !74, line: 267, size: 160, elements: !189)
!189 = !{!190, !199, !200}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !188, file: !74, line: 268, baseType: !191, size: 96)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !192, line: 51, size: 96, elements: !193)
!192 = !DIFile(filename: "zephyrproject/zephyr/include/sys/sys_heap.h", directory: "/home/kenny")
!193 = !{!194, !197, !198}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !191, file: !192, line: 52, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !192, line: 52, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !191, file: !192, line: 53, baseType: !58, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !191, file: !192, line: 54, baseType: !178, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !188, file: !74, line: 269, baseType: !73, size: 64, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !188, file: !74, line: 270, baseType: !201, offset: 160)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !74, line: 234, elements: !202)
!202 = !{}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !101, file: !6, line: 644, baseType: !204, size: 64, offset: 960)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !154, line: 60, size: 64, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !204, file: !154, line: 63, baseType: !60, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !204, file: !154, line: 66, baseType: !60, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !97, file: !6, line: 1101, baseType: !209, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !211, line: 44, baseType: !212)
!211 = !DIFile(filename: "zephyrproject/zephyr/include/sys/arch_interface.h", directory: "/home/kenny")
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !213, line: 35, size: 8, elements: !214)
!213 = !DIFile(filename: "zephyrproject/zephyr/include/sys/thread_stack.h", directory: "/home/kenny")
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !212, file: !213, line: 36, baseType: !216, size: 8)
!216 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !97, file: !6, line: 1102, baseType: !61, size: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !97, file: !6, line: 1103, baseType: !219, size: 32, offset: 96)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !211, line: 46, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !58, !58, !58}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !97, file: !6, line: 1104, baseType: !58, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !97, file: !6, line: 1105, baseType: !58, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !97, file: !6, line: 1106, baseType: !58, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !97, file: !6, line: 1107, baseType: !59, size: 32, offset: 224)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !97, file: !6, line: 1108, baseType: !60, size: 32, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !97, file: !6, line: 1109, baseType: !229, size: 32, offset: 288)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !56, line: 42, baseType: !59)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !97, file: !6, line: 1110, baseType: !167, size: 32, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !97, file: !6, line: 1111, baseType: !232, size: 32, offset: 352)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "thread_a", scope: !2, file: !65, line: 70, type: !236, isLocal: false, isDefinition: true)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !6, line: 648, baseType: !100)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "threadB_stack_area", scope: !2, file: !65, line: 52, type: !240, isLocal: false, isDefinition: true, align: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 8192, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 1024)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "threadB_data", scope: !2, file: !65, line: 53, type: !101, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_a", scope: !2, file: !65, line: 70, type: !240, isLocal: false, isDefinition: true, align: 64)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_a", scope: !2, file: !65, line: 70, type: !101, isLocal: false, isDefinition: true)
!249 = !{!"clang version 9.0.1-12 "}
!250 = !{i32 2, !"Dwarf Version", i32 4}
!251 = !{i32 2, !"Debug Info Version", i32 3}
!252 = !{i32 1, !"wchar_size", i32 4}
!253 = !{i32 1, !"min_enum_size", i32 1}
!254 = distinct !DISubprogram(name: "threadA", scope: !65, file: !65, line: 55, type: !221, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !202)
!255 = !DILocalVariable(name: "dummy1", arg: 1, scope: !254, file: !65, line: 55, type: !58)
!256 = !DILocation(line: 55, column: 20, scope: !254)
!257 = !DILocalVariable(name: "dummy2", arg: 2, scope: !254, file: !65, line: 55, type: !58)
!258 = !DILocation(line: 55, column: 34, scope: !254)
!259 = !DILocalVariable(name: "dummy3", arg: 3, scope: !254, file: !65, line: 55, type: !58)
!260 = !DILocation(line: 55, column: 48, scope: !254)
!261 = !DILocation(line: 57, column: 2, scope: !254)
!262 = !DILocation(line: 58, column: 2, scope: !254)
!263 = !DILocation(line: 59, column: 2, scope: !254)
!264 = !DILocalVariable(name: "tid", scope: !254, file: !65, line: 61, type: !237)
!265 = !DILocation(line: 61, column: 10, scope: !254)
!266 = !DILocation(line: 63, column: 17, scope: !254)
!267 = !DILocation(line: 61, column: 16, scope: !254)
!268 = !DILocation(line: 65, column: 20, scope: !254)
!269 = !DILocation(line: 65, column: 2, scope: !254)
!270 = !DILocation(line: 67, column: 2, scope: !254)
!271 = !DILocation(line: 68, column: 1, scope: !254)
!272 = distinct !DISubprogram(name: "threadB", scope: !65, file: !65, line: 43, type: !221, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !202)
!273 = !DILocalVariable(name: "dummy1", arg: 1, scope: !272, file: !65, line: 43, type: !58)
!274 = !DILocation(line: 43, column: 20, scope: !272)
!275 = !DILocalVariable(name: "dummy2", arg: 2, scope: !272, file: !65, line: 43, type: !58)
!276 = !DILocation(line: 43, column: 34, scope: !272)
!277 = !DILocalVariable(name: "dummy3", arg: 3, scope: !272, file: !65, line: 43, type: !58)
!278 = !DILocation(line: 43, column: 48, scope: !272)
!279 = !DILocation(line: 45, column: 2, scope: !272)
!280 = !DILocation(line: 46, column: 2, scope: !272)
!281 = !DILocation(line: 47, column: 2, scope: !272)
!282 = !DILocation(line: 49, column: 2, scope: !272)
!283 = !DILocation(line: 50, column: 1, scope: !272)
