; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.z_thread_stack_element = type { i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, void ()*, i32, %struct._thread_stack_info, %struct.k_mem_pool*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout, %struct._wait_q_t }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_mem_pool = type { %struct.k_heap* }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct._static_thread_data = type { %struct.k_thread*, %struct.z_thread_stack_element*, i32, void (i8*, i8*, i8*)*, i8*, i8*, i8*, i32, i32, i32, void ()*, i8* }
%struct.k_timeout_t = type { i64 }


!15 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "K_OBJ_SEM", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "K_OBJ_STACK", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17, isUnsigned: true)
!27 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18, isUnsigned: true)
!28 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 19, isUnsigned: true)
!29 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 20, isUnsigned: true)
!30 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 21, isUnsigned: true)
!31 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 22, isUnsigned: true)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 23, isUnsigned: true)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 24, isUnsigned: true)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 25, isUnsigned: true)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 26, isUnsigned: true)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 27, isUnsigned: true)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 28, isUnsigned: true)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 29, isUnsigned: true)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 30, isUnsigned: true)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 31, isUnsigned: true)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 32, isUnsigned: true)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 33, isUnsigned: true)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 34, isUnsigned: true)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 35, isUnsigned: true)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 36, isUnsigned: true)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 37, isUnsigned: true)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 38, isUnsigned: true)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 39, isUnsigned: true)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 40, isUnsigned: true)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 41, isUnsigned: true)
!51 = !DIEnumerator(name: "K_OBJ_LAST", value: 42, isUnsigned: true)
!52 = !{!53, !58, !59, !60}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !54, line: 46, baseType: !55)
!54 = !DIFile(filename: "zephyrproject/zephyr/include/sys_clock.h", directory: "/home/kenny")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 43, baseType: !57)
!56 = !DIFile(filename: "zephyrproject/zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/kenny")
!57 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !56, line: 57, baseType: !61)
!61 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!62 = !{!0, !63, !91, !230, !234, !239, !241, !243}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "threadB_sem", scope: !2, file: !65, line: 39, type: !66, isLocal: false, isDefinition: true, align: 32)
!65 = !DIFile(filename: "appl/Zephyr/static_sems/src/main.c", directory: "/home/kenny/ara")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !6, line: 3704, size: 128, elements: !67)
!67 = !{!68, !89, !90}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !66, file: !6, line: 3705, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !70, line: 210, baseType: !71)
!70 = !DIFile(filename: "zephyrproject/zephyr/include/kernel_structs.h", directory: "/home/kenny")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 208, size: 64, elements: !72)
!72 = !{!73}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !71, file: !70, line: 209, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !75, line: 42, baseType: !76)
!75 = !DIFile(filename: "zephyrproject/zephyr/include/sys/dlist.h", directory: "/home/kenny")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !75, line: 31, size: 64, elements: !77)
!77 = !{!78, !84}
!78 = !DIDerivedType(tag: DW_TAG_member, scope: !76, file: !75, line: 32, baseType: !79, size: 32)
!79 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !76, file: !75, line: 32, size: 32, elements: !80)
!80 = !{!81, !83}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !79, file: !75, line: 33, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !79, file: !75, line: 34, baseType: !82, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, scope: !76, file: !75, line: 36, baseType: !85, size: 32, offset: 32)
!85 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !76, file: !75, line: 36, size: 32, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !85, file: !75, line: 37, baseType: !82, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !85, file: !75, line: 38, baseType: !82, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !66, file: !6, line: 3706, baseType: !60, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !66, file: !6, line: 3707, baseType: !60, size: 32, offset: 96)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_a", scope: !2, file: !65, line: 69, type: !93, isLocal: false, isDefinition: true, align: 32)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !6, line: 1099, size: 384, elements: !94)
!94 = !{!95, !204, !213, !214, !219, !220, !221, !222, !223, !224, !226, !227}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !93, file: !6, line: 1100, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !6, line: 570, size: 1024, elements: !98)
!98 = !{!99, !148, !161, !162, !166, !167, !177, !199}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !97, file: !6, line: 572, baseType: !100, size: 448)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !6, line: 441, size: 448, elements: !101)
!101 = !{!102, !116, !118, !120, !121, !134, !135, !136, !147}
!102 = !DIDerivedType(tag: DW_TAG_member, scope: !100, file: !6, line: 444, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !6, line: 444, size: 64, elements: !104)
!104 = !{!105, !107}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !103, file: !6, line: 445, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !75, line: 43, baseType: !76)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !103, file: !6, line: 446, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !109, line: 48, size: 64, elements: !110)
!109 = !DIFile(filename: "zephyrproject/zephyr/include/sys/rb.h", directory: "/home/kenny")
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !108, file: !109, line: 49, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 64, elements: !114)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!114 = !{!115}
!115 = !DISubrange(count: 2)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !100, file: !6, line: 452, baseType: !117, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !100, file: !6, line: 455, baseType: !119, size: 8, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !56, line: 55, baseType: !7)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !100, file: !6, line: 458, baseType: !119, size: 8, offset: 104)
!121 = !DIDerivedType(tag: DW_TAG_member, scope: !100, file: !6, line: 474, baseType: !122, size: 16, offset: 112)
!122 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !6, line: 474, size: 16, elements: !123)
!123 = !{!124, !131}
!124 = !DIDerivedType(tag: DW_TAG_member, scope: !122, file: !6, line: 475, baseType: !125, size: 16)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !6, line: 475, size: 16, elements: !126)
!126 = !{!127, !130}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !125, file: !6, line: 480, baseType: !128, size: 8)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !56, line: 40, baseType: !129)
!129 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !125, file: !6, line: 481, baseType: !119, size: 8, offset: 8)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !122, file: !6, line: 484, baseType: !132, size: 16)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !56, line: 56, baseType: !133)
!133 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !100, file: !6, line: 491, baseType: !60, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !100, file: !6, line: 511, baseType: !58, size: 32, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !100, file: !6, line: 515, baseType: !137, size: 192, offset: 192)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !70, line: 221, size: 192, elements: !138)
!138 = !{!139, !140, !146}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !137, file: !70, line: 222, baseType: !106, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !137, file: !70, line: 223, baseType: !141, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !70, line: 219, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !137, file: !70, line: 226, baseType: !55, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "join_waiters", scope: !100, file: !6, line: 518, baseType: !69, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !97, file: !6, line: 575, baseType: !149, size: 288, offset: 448)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !150, line: 25, size: 288, elements: !151)
!150 = !DIFile(filename: "zephyrproject/zephyr/include/arch/arm/aarch32/thread.h", directory: "/home/kenny")
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159, !160}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !149, file: !150, line: 26, baseType: !60, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !149, file: !150, line: 27, baseType: !60, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !149, file: !150, line: 28, baseType: !60, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !149, file: !150, line: 29, baseType: !60, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !149, file: !150, line: 30, baseType: !60, size: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !149, file: !150, line: 31, baseType: !60, size: 32, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !149, file: !150, line: 32, baseType: !60, size: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !149, file: !150, line: 33, baseType: !60, size: 32, offset: 224)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !149, file: !150, line: 34, baseType: !60, size: 32, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !97, file: !6, line: 578, baseType: !58, size: 32, offset: 736)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "fn_abort", scope: !97, file: !6, line: 583, baseType: !163, size: 32, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DISubroutineType(types: !165)
!165 = !{null}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !97, file: !6, line: 610, baseType: !59, size: 32, offset: 800)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !97, file: !6, line: 616, baseType: !168, size: 96, offset: 832)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !6, line: 525, size: 96, elements: !169)
!169 = !{!170, !173, !176}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !168, file: !6, line: 529, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !56, line: 71, baseType: !172)
!172 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !168, file: !6, line: 538, baseType: !174, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !175, line: 46, baseType: !61)
!175 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!176 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !168, file: !6, line: 544, baseType: !174, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !97, file: !6, line: 641, baseType: !178, size: 32, offset: 928)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_pool", file: !180, line: 30, size: 32, elements: !181)
!180 = !DIFile(filename: "zephyrproject/zephyr/include/mempool_heap.h", directory: "/home/kenny")
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !179, file: !180, line: 31, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !70, line: 267, size: 160, elements: !185)
!185 = !{!186, !195, !196}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !184, file: !70, line: 268, baseType: !187, size: 96)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !188, line: 51, size: 96, elements: !189)
!188 = !DIFile(filename: "zephyrproject/zephyr/include/sys/sys_heap.h", directory: "/home/kenny")
!189 = !{!190, !193, !194}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !187, file: !188, line: 52, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !188, line: 52, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !187, file: !188, line: 53, baseType: !58, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !187, file: !188, line: 54, baseType: !174, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !184, file: !70, line: 269, baseType: !69, size: 64, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !184, file: !70, line: 270, baseType: !197, offset: 160)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !70, line: 234, elements: !198)
!198 = !{}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !97, file: !6, line: 644, baseType: !200, size: 64, offset: 960)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !150, line: 60, size: 64, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !200, file: !150, line: 63, baseType: !60, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !200, file: !150, line: 66, baseType: !60, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !93, file: !6, line: 1101, baseType: !205, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !207, line: 44, baseType: !208)
!207 = !DIFile(filename: "zephyrproject/zephyr/include/sys/arch_interface.h", directory: "/home/kenny")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !209, line: 35, size: 8, elements: !210)
!209 = !DIFile(filename: "zephyrproject/zephyr/include/sys/thread_stack.h", directory: "/home/kenny")
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !209, line: 36, baseType: !212, size: 8)
!212 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !93, file: !6, line: 1102, baseType: !61, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !93, file: !6, line: 1103, baseType: !215, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !207, line: 46, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !58, !58, !58}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !93, file: !6, line: 1104, baseType: !58, size: 32, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !93, file: !6, line: 1105, baseType: !58, size: 32, offset: 160)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !93, file: !6, line: 1106, baseType: !58, size: 32, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !93, file: !6, line: 1107, baseType: !59, size: 32, offset: 224)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !93, file: !6, line: 1108, baseType: !60, size: 32, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !93, file: !6, line: 1109, baseType: !225, size: 32, offset: 288)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !56, line: 42, baseType: !59)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !93, file: !6, line: 1110, baseType: !163, size: 32, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !93, file: !6, line: 1111, baseType: !228, size: 32, offset: 352)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "thread_a", scope: !2, file: !65, line: 69, type: !232, isLocal: false, isDefinition: true)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !6, line: 648, baseType: !96)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "threadB_stack_area", scope: !2, file: !65, line: 51, type: !236, isLocal: false, isDefinition: true, align: 64)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 8192, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 1024)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "threadB_data", scope: !2, file: !65, line: 52, type: !97, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_a", scope: !2, file: !65, line: 69, type: !236, isLocal: false, isDefinition: true, align: 64)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_a", scope: !2, file: !65, line: 69, type: !97, isLocal: false, isDefinition: true)
!245 = !{!"clang version 9.0.1-12 "}
!246 = !{i32 2, !"Dwarf Version", i32 4}
!247 = !{i32 2, !"Debug Info Version", i32 3}
!248 = !{i32 1, !"wchar_size", i32 4}
!249 = !{i32 1, !"min_enum_size", i32 1}
!250 = distinct !DISubprogram(name: "threadA", scope: !65, file: !65, line: 54, type: !217, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !198)
!251 = !DILocalVariable(name: "dummy1", arg: 1, scope: !250, file: !65, line: 54, type: !58)
!252 = !DILocation(line: 54, column: 20, scope: !250)
!253 = !DILocalVariable(name: "dummy2", arg: 2, scope: !250, file: !65, line: 54, type: !58)
!254 = !DILocation(line: 54, column: 34, scope: !250)
!255 = !DILocalVariable(name: "dummy3", arg: 3, scope: !250, file: !65, line: 54, type: !58)
!256 = !DILocation(line: 54, column: 48, scope: !250)
!257 = !DILocation(line: 56, column: 2, scope: !250)
!258 = !DILocation(line: 57, column: 2, scope: !250)
!259 = !DILocation(line: 58, column: 2, scope: !250)
!260 = !DILocalVariable(name: "tid", scope: !250, file: !65, line: 60, type: !233)
!261 = !DILocation(line: 60, column: 10, scope: !250)
!262 = !DILocation(line: 62, column: 17, scope: !250)
!263 = !DILocation(line: 60, column: 16, scope: !250)
!264 = !DILocation(line: 64, column: 20, scope: !250)
!265 = !DILocation(line: 64, column: 2, scope: !250)
!266 = !DILocation(line: 66, column: 2, scope: !250)
!267 = !DILocation(line: 67, column: 1, scope: !250)
!268 = distinct !DISubprogram(name: "threadB", scope: !65, file: !65, line: 42, type: !217, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !198)
!269 = !DILocalVariable(name: "dummy1", arg: 1, scope: !268, file: !65, line: 42, type: !58)
!270 = !DILocation(line: 42, column: 20, scope: !268)
!271 = !DILocalVariable(name: "dummy2", arg: 2, scope: !268, file: !65, line: 42, type: !58)
!272 = !DILocation(line: 42, column: 34, scope: !268)
!273 = !DILocalVariable(name: "dummy3", arg: 3, scope: !268, file: !65, line: 42, type: !58)
!274 = !DILocation(line: 42, column: 48, scope: !268)
!275 = !DILocation(line: 44, column: 2, scope: !268)
!276 = !DILocation(line: 45, column: 2, scope: !268)
!277 = !DILocation(line: 46, column: 2, scope: !268)
!278 = !DILocation(line: 48, column: 2, scope: !268)
!279 = !DILocation(line: 49, column: 1, scope: !268)
